[NoCoverage] ConditionalExpression
src/application/mission/create-mission.use-case.ts:35:21
                 const category = await this.missionCategoryService.getMissionCategoryById(missionDTO.mission.category_id, transactionManager);
 
                 //REMENBER: cadastrar na tabela de categorias os valores iguais a mission_details_type
-                if (category.category.toUpperCase() !== missionDTO.mission.mission_details_type.toUpperCase()) {
+                if (false) {
                     throw new BadRequestException('Categoria inválida.');
                 };

[NoCoverage] ConditionalExpression
src/application/mission/create-mission.use-case.ts:35:21
                 const category = await this.missionCategoryService.getMissionCategoryById(missionDTO.mission.category_id, transactionManager);
 
                 //REMENBER: cadastrar na tabela de categorias os valores iguais a mission_details_type
-                if (category.category.toUpperCase() !== missionDTO.mission.mission_details_type.toUpperCase()) {
+                if (true) {
                     throw new BadRequestException('Categoria inválida.');
                 };

[NoCoverage] StringLiteral
src/application/mission/create-mission.use-case.ts:36:51
 
                 //REMENBER: cadastrar na tabela de categorias os valores iguais a mission_details_type
                 if (category.category.toUpperCase() !== missionDTO.mission.mission_details_type.toUpperCase()) {
-                    throw new BadRequestException('Categoria inválida.');
+                    throw new BadRequestException("");
                 };
 

[NoCoverage] ConditionalExpression
src/application/mission/create-mission.use-case.ts:42:21
                 const mission = await this.missionService.createMission(missionDTO.mission, category, transactionManager);
 
                 switch (mission.mission_details_type) {
-                    case MissionDetailsType.PERSON:
-                        await this.personMissionService.createPersonMission(missionDTO.mission_details_person, mission.id, transactionManager);
-                        break;
+                    case MissionDetailsType.PERSON:
                     case MissionDetailsType.PET:
                         await this.petMissionService.createPetMission(missionDTO.mission_details_pet, mission.id, transactionManager);

[NoCoverage] ConditionalExpression
src/application/mission/create-mission.use-case.ts:45:21
                     case MissionDetailsType.PERSON:
                         await this.personMissionService.createPersonMission(missionDTO.mission_details_person, mission.id, transactionManager);
                         break;
-                    case MissionDetailsType.PET:
-                        await this.petMissionService.createPetMission(missionDTO.mission_details_pet, mission.id, transactionManager);
-                        break;
+                    case MissionDetailsType.PET:
                     case MissionDetailsType.OBJECT:
                         const object_category = await this.objectMissionCategoriesService.getMissionCategoryById(missionDTO.mission_details_object.object_category_id, transactionManager);

[NoCoverage] ConditionalExpression
src/application/mission/create-mission.use-case.ts:48:21
                     case MissionDetailsType.PET:
                         await this.petMissionService.createPetMission(missionDTO.mission_details_pet, mission.id, transactionManager);
                         break;
-                    case MissionDetailsType.OBJECT:
-                        const object_category = await this.objectMissionCategoriesService.getMissionCategoryById(missionDTO.mission_details_object.object_category_id, transactionManager);
-
-                        await this.objectMissionService.createObjectMission(missionDTO.mission_details_object, mission.id, object_category, transactionManager);
-                        break;
+                    case MissionDetailsType.OBJECT:
                     default:
                         break;

[NoCoverage] BlockStatement
src/application/mission/create-mission.use-case.ts:58:29
                 };
 
                 return mission;
-            } catch (error) {
-                throw error;
-            }
+            } catch (error) {}
         });
     }
