[NoCoverage] BlockStatement
src/application/mission/get-all-missions.use-case.ts:11:47
         private readonly missionService: MissionService
     ) { }
 
-    async execute(): Promise<MissionEntity[]> {
-        const missions = await this.missionService.getAllMissions();
-        return missions;
-    }
+    async execute(): Promise<MissionEntity[]> {}
 }
