[NoCoverage] BlockStatement
src/application/mission/update-mission-rewards.use-case.ts:16:93
         private readonly entityManager: EntityManager
     ) { }
 
-    async execute(UpdateMissionRewardsDTO: UpdateMissionRewardsDTO): Promise<MissionEntity> {
-        return await this.entityManager.transaction(async (transactionManager) => {
-            try {
-                const mission = await this.missionService.getMissionById(UpdateMissionRewardsDTO.mission_id, transactionManager);
-
-                await this.missionService.updateMissionRewards(UpdateMissionRewardsDTO, mission, transactionManager);
-
-                await this.rewardsEditionsService.createRewardsEdition({
-                    mission_id: mission.id,
-                    value: UpdateMissionRewardsDTO.reward
-                }, transactionManager);
-
-                return mission;
-            } catch (error) {
-                throw error;
-            }
-        });
-    };
+    async execute(UpdateMissionRewardsDTO: UpdateMissionRewardsDTO): Promise<MissionEntity> {};
 };

[NoCoverage] BlockStatement
src/application/mission/update-mission-rewards.use-case.ts:17:83
     ) { }
 
     async execute(UpdateMissionRewardsDTO: UpdateMissionRewardsDTO): Promise<MissionEntity> {
-        return await this.entityManager.transaction(async (transactionManager) => {
-            try {
-                const mission = await this.missionService.getMissionById(UpdateMissionRewardsDTO.mission_id, transactionManager);
-
-                await this.missionService.updateMissionRewards(UpdateMissionRewardsDTO, mission, transactionManager);
-
-                await this.rewardsEditionsService.createRewardsEdition({
-                    mission_id: mission.id,
-                    value: UpdateMissionRewardsDTO.reward
-                }, transactionManager);
-
-                return mission;
-            } catch (error) {
-                throw error;
-            }
-        });
+        return await this.entityManager.transaction(async (transactionManager) => {});
     };
 };

[NoCoverage] BlockStatement
src/application/mission/update-mission-rewards.use-case.ts:18:17
 
     async execute(UpdateMissionRewardsDTO: UpdateMissionRewardsDTO): Promise<MissionEntity> {
         return await this.entityManager.transaction(async (transactionManager) => {
-            try {
-                const mission = await this.missionService.getMissionById(UpdateMissionRewardsDTO.mission_id, transactionManager);
-
-                await this.missionService.updateMissionRewards(UpdateMissionRewardsDTO, mission, transactionManager);
-
-                await this.rewardsEditionsService.createRewardsEdition({
-                    mission_id: mission.id,
-                    value: UpdateMissionRewardsDTO.reward
-                }, transactionManager);
-
-                return mission;
-            } catch (error) {
+            try {} catch (error) {
                 throw error;
             }
