[NoCoverage] BlockStatement
src/application/mission/update-mission.use-case.ts:12:79
         private readonly missionService: MissionService
     ) { }
 
-    async execute(updateMissionDTO: UpdateMissionDTO): Promise<MissionEntity> {
-        const mission = await this.missionService.getMissionById(updateMissionDTO.mission_id);
-
-        const updated_mission = await this.missionService.updateMission(updateMissionDTO, mission);
-        return updated_mission;
-    }
+    async execute(updateMissionDTO: UpdateMissionDTO): Promise<MissionEntity> {}
 }
