[NoCoverage] BlockStatement
src/application/mission-categories/create-mission-category.use-case.ts:11:63
         private readonly missionCategoryService: MissionCategoryService
     ) { }
 
-    async execute(createMissionDTO: CreateMissionCategoryDTO) {
-        try {
-            const created_mission_category = await this.missionCategoryService.createMissionCategory(createMissionDTO);
-            return created_mission_category;
-        } catch (error) {
-            throw error;
-        }
-    }
+    async execute(createMissionDTO: CreateMissionCategoryDTO) {}
 }

[NoCoverage] BlockStatement
src/application/mission-categories/create-mission-category.use-case.ts:12:13
     ) { }
 
     async execute(createMissionDTO: CreateMissionCategoryDTO) {
-        try {
-            const created_mission_category = await this.missionCategoryService.createMissionCategory(createMissionDTO);
-            return created_mission_category;
-        } catch (error) {
+        try {} catch (error) {
             throw error;
         }

[NoCoverage] BlockStatement
src/application/mission-categories/create-mission-category.use-case.ts:15:25
         try {
             const created_mission_category = await this.missionCategoryService.createMissionCategory(createMissionDTO);
             return created_mission_category;
-        } catch (error) {
-            throw error;
-        }
+        } catch (error) {}
     }
 }
