[NoCoverage] BlockStatement
src/application/mission-categories/update-mission-category.use-case.ts:11:71
         private readonly missionCategoryService: MissionCategoryService
     ) { }
 
-    async execute(updateMissionCategoryDTO: UpdateMissionCategoryDTO) {
-        try {
-            const category = await this.missionCategoryService.updateMissionCategory(updateMissionCategoryDTO);
-            return category;
-        } catch (error) {
-            throw error;
-        }
-    }
+    async execute(updateMissionCategoryDTO: UpdateMissionCategoryDTO) {}
 }

[NoCoverage] BlockStatement
src/application/mission-categories/update-mission-category.use-case.ts:12:13
     ) { }
 
     async execute(updateMissionCategoryDTO: UpdateMissionCategoryDTO) {
-        try {
-            const category = await this.missionCategoryService.updateMissionCategory(updateMissionCategoryDTO);
-            return category;
-        } catch (error) {
+        try {} catch (error) {
             throw error;
         }

[NoCoverage] BlockStatement
src/application/mission-categories/update-mission-category.use-case.ts:15:25
         try {
             const category = await this.missionCategoryService.updateMissionCategory(updateMissionCategoryDTO);
             return category;
-        } catch (error) {
-            throw error;
-        }
+        } catch (error) {}
     }
 }
