[NoCoverage] BlockStatement
src/application/object-mission-categories/create-object-mission-category.use-case.ts:11:83
         private readonly objectMissionCategoriseService: ObjectMissionCategoriesService
     ) { }
 
-    async execute(createObjectMissionCategoryDTO: CreateObjectMissionCategoryDTO) {
-        try {
-            const created_object_mission_category = await this.objectMissionCategoriseService.createObjectMissionCategory(createObjectMissionCategoryDTO);
-            return created_object_mission_category;
-        } catch (error) {
-            throw error;
-        }
-    }
+    async execute(createObjectMissionCategoryDTO: CreateObjectMissionCategoryDTO) {}
 }

[NoCoverage] BlockStatement
src/application/object-mission-categories/create-object-mission-category.use-case.ts:12:13
     ) { }
 
     async execute(createObjectMissionCategoryDTO: CreateObjectMissionCategoryDTO) {
-        try {
-            const created_object_mission_category = await this.objectMissionCategoriseService.createObjectMissionCategory(createObjectMissionCategoryDTO);
-            return created_object_mission_category;
-        } catch (error) {
+        try {} catch (error) {
             throw error;
         }

[NoCoverage] BlockStatement
src/application/object-mission-categories/create-object-mission-category.use-case.ts:15:25
         try {
             const created_object_mission_category = await this.objectMissionCategoriseService.createObjectMissionCategory(createObjectMissionCategoryDTO);
             return created_object_mission_category;
-        } catch (error) {
-            throw error;
-        }
+        } catch (error) {}
     }
 }
