[NoCoverage] BlockStatement
src/application/object-mission-categories/update-object-mission-category.use-case.ts:11:83
         private readonly objectMissionCategoriesService: ObjectMissionCategoriesService
     ) { }
 
-    async execute(updateObjectMissionCategoryDTO: UpdateObjectMissionCategoryDTO) {
-        try {
-            const category = await this.objectMissionCategoriesService.updateObjectMissionCategory(updateObjectMissionCategoryDTO);
-            return category;
-        } catch (error) {
-            throw error;
-        }
-    }
+    async execute(updateObjectMissionCategoryDTO: UpdateObjectMissionCategoryDTO) {}
 }

[NoCoverage] BlockStatement
src/application/object-mission-categories/update-object-mission-category.use-case.ts:12:13
     ) { }
 
     async execute(updateObjectMissionCategoryDTO: UpdateObjectMissionCategoryDTO) {
-        try {
-            const category = await this.objectMissionCategoriesService.updateObjectMissionCategory(updateObjectMissionCategoryDTO);
-            return category;
-        } catch (error) {
+        try {} catch (error) {
             throw error;
         }
