[NoCoverage] BlockStatement
src/application/user/create-user.use-case.ts:13:70
     ) { }
 
     // TODO: incluir sexo da pessoa
-    async execute(createUserDTO: CreateUserDTO): Promise<UserEntity> {
-        const user = await this.userService.createUser(createUserDTO);
-        return user;
-    }
+    async execute(createUserDTO: CreateUserDTO): Promise<UserEntity> {}
 }
