[NoCoverage] BlockStatement
src/application/user/get-user-by-id.use-case.ts:11:57
         private readonly userService: UserService
     ) { }
 
-    async execute(user_id: string): Promise<UserEntity> {
-        const user = await this.userService.getUserById(user_id);
-        return user;
-    }
+    async execute(user_id: string): Promise<UserEntity> {}
 }
