[NoCoverage] BlockStatement
infrastructure/database/mission/mission.repository.ts:19:113
 
 
     // TODO: depois diferenciar um métodos para trazer mais detalhes da missão em busca por id
-    async getMissionById(mission_id: string, transactionManager?: EntityManager): Promise<MissionEntity | null> {
-        return transactionManager
-            ? transactionManager.findOne(MissionModel, { where: { id: mission_id } })
-            : this.missionRepository.findOne({ where: { id: mission_id } });
-    }
+    async getMissionById(mission_id: string, transactionManager?: EntityManager): Promise<MissionEntity | null> {}
 
     async getAllMissions(): Promise<MissionEntity[]> {

[NoCoverage] ObjectLiteral
infrastructure/database/mission/mission.repository.ts:21:56
     // TODO: depois diferenciar um métodos para trazer mais detalhes da missão em busca por id
     async getMissionById(mission_id: string, transactionManager?: EntityManager): Promise<MissionEntity | null> {
         return transactionManager
-            ? transactionManager.findOne(MissionModel, { where: { id: mission_id } })
+            ? transactionManager.findOne(MissionModel, {})
             : this.missionRepository.findOne({ where: { id: mission_id } });
     }

[NoCoverage] ObjectLiteral
infrastructure/database/mission/mission.repository.ts:22:46
     async getMissionById(mission_id: string, transactionManager?: EntityManager): Promise<MissionEntity | null> {
         return transactionManager
             ? transactionManager.findOne(MissionModel, { where: { id: mission_id } })
-            : this.missionRepository.findOne({ where: { id: mission_id } });
+            : this.missionRepository.findOne({});
     }
 

[NoCoverage] BlockStatement
infrastructure/database/mission/mission.repository.ts:25:54
             : this.missionRepository.findOne({ where: { id: mission_id } });
     }
 
-    async getAllMissions(): Promise<MissionEntity[]> {
-        const missions = await this.missionRepository.find();
-        return missions;
-    }
+    async getAllMissions(): Promise<MissionEntity[]> {}
 
     // TODO: refatorar para retornar por inferência e não a entidade

[NoCoverage] BlockStatement
infrastructure/database/mission/mission.repository.ts:31:61
     }
 
     // TODO: refatorar para retornar por inferência e não a entidade
-    createMission(mission: CreateMissionDTO): MissionEntity {
-        const created_mission = this.missionRepository.create(mission);
-        return created_mission;
-    }
+    createMission(mission: CreateMissionDTO): MissionEntity {}
 
     async saveOnCreateMission(mission: MissionEntity, category: MissionCategoryEntity, transactionManager?: EntityManager) {

[NoCoverage] BlockStatement
infrastructure/database/mission/mission.repository.ts:36:124
         return created_mission;
     }
 
-    async saveOnCreateMission(mission: MissionEntity, category: MissionCategoryEntity, transactionManager?: EntityManager) {
-        return transactionManager ? await transactionManager.save(MissionModel, {
-            ...mission,
-            categories: [category]
-        }) : await this.missionRepository.save({
-            ...mission,
-            categories: [category]
-        });
-    }
+    async saveOnCreateMission(mission: MissionEntity, category: MissionCategoryEntity, transactionManager?: EntityManager) {}
 
     async saveMission(mission: MissionEntity, transactionManager?: EntityManager) {

[NoCoverage] ArrayDeclaration
infrastructure/database/mission/mission.repository.ts:39:25
     async saveOnCreateMission(mission: MissionEntity, category: MissionCategoryEntity, transactionManager?: EntityManager) {
         return transactionManager ? await transactionManager.save(MissionModel, {
             ...mission,
-            categories: [category]
+            categories: []
         }) : await this.missionRepository.save({
             ...mission,

[NoCoverage] BlockStatement
infrastructure/database/mission/mission.repository.ts:46:83
         });
     }
 
-    async saveMission(mission: MissionEntity, transactionManager?: EntityManager) {
-        return transactionManager ? await transactionManager.save(MissionModel, mission) : await this.missionRepository.save(mission);
-    }
+    async saveMission(mission: MissionEntity, transactionManager?: EntityManager) {}
 }
