[NoCoverage] BlockStatement
infrastructure/database/mission-categories/mission-categories.repository.ts:17:71
     ) { }
 
     // TODO: implementar e testar
-    async getAllMissionCategories(): Promise<MissionCategoryEntity[]> {
-        throw new Error('Method not implemented.');
-    };
+    async getAllMissionCategories(): Promise<MissionCategoryEntity[]> {};
 
     async getCategoryById(category_id: string, transactionManager?: EntityManager): Promise<MissionCategoryEntity | null> {

[NoCoverage] BlockStatement
infrastructure/database/mission-categories/mission-categories.repository.ts:21:123
         throw new Error('Method not implemented.');
     };
 
-    async getCategoryById(category_id: string, transactionManager?: EntityManager): Promise<MissionCategoryEntity | null> {
-        return transactionManager
-            ? await transactionManager.findOne(MissionCategoryModel, { where: { id: category_id } })
-            : await this.missionRepository.findOne({ where: { id: category_id } });
-    };
+    async getCategoryById(category_id: string, transactionManager?: EntityManager): Promise<MissionCategoryEntity | null> {};
 
     async getCategoryByName(category_name: string): Promise<MissionCategoryEntity | null> {

[NoCoverage] ObjectLiteral
infrastructure/database/mission-categories/mission-categories.repository.ts:24:61
     async getCategoryById(category_id: string, transactionManager?: EntityManager): Promise<MissionCategoryEntity | null> {
         return transactionManager
             ? await transactionManager.findOne(MissionCategoryModel, { where: { id: category_id } })
-            : await this.missionRepository.findOne({ where: { id: category_id } });
+            : await this.missionRepository.findOne({ where: {} });
     };
 

[NoCoverage] BlockStatement
infrastructure/database/mission-categories/mission-categories.repository.ts:27:91
             : await this.missionRepository.findOne({ where: { id: category_id } });
     };
 
-    async getCategoryByName(category_name: string): Promise<MissionCategoryEntity | null> {
-        const category = this.missionRepository.findOne({
-            where: {
-                category: category_name,
-            }
-        });
-
-        return category;
-    };
+    async getCategoryByName(category_name: string): Promise<MissionCategoryEntity | null> {};
 
     async getCategoryByLevel(category_level: number): Promise<MissionCategoryEntity | null> {

[NoCoverage] BlockStatement
infrastructure/database/mission-categories/mission-categories.repository.ts:37:93
         return category;
     };
 
-    async getCategoryByLevel(category_level: number): Promise<MissionCategoryEntity | null> {
-        const category = this.missionRepository.findOne({
-            where: {
-                level: category_level,
-            }
-        });
-
-        return category;
-    };
+    async getCategoryByLevel(category_level: number): Promise<MissionCategoryEntity | null> {};
 
     createCategory(mission_category: CreateMissionCategoryDTO): MissionCategoryEntity {

[NoCoverage] ObjectLiteral
infrastructure/database/mission-categories/mission-categories.repository.ts:39:20
 
     async getCategoryByLevel(category_level: number): Promise<MissionCategoryEntity | null> {
         const category = this.missionRepository.findOne({
-            where: {
-                level: category_level,
-            }
+            where: {}
         });
 

[NoCoverage] BlockStatement
infrastructure/database/mission-categories/mission-categories.repository.ts:47:87
         return category;
     };
 
-    createCategory(mission_category: CreateMissionCategoryDTO): MissionCategoryEntity {
-        const created_mission_category = this.missionRepository.create(mission_category);
-        return created_mission_category;
-    };
+    createCategory(mission_category: CreateMissionCategoryDTO): MissionCategoryEntity {};
 
     async saveCategory(mission_category: MissionCategoryEntity, transactionManager?: EntityManager): Promise<MissionCategoryEntity> {

[NoCoverage] BlockStatement
infrastructure/database/mission-categories/mission-categories.repository.ts:52:133
         return created_mission_category;
     };
 
-    async saveCategory(mission_category: MissionCategoryEntity, transactionManager?: EntityManager): Promise<MissionCategoryEntity> {
-        return transactionManager ? await transactionManager.save(MissionCategoryModel, mission_category) : await this.missionRepository.save(mission_category);
-    };
+    async saveCategory(mission_category: MissionCategoryEntity, transactionManager?: EntityManager): Promise<MissionCategoryEntity> {};
 }
