[NoCoverage] BlockStatement
infrastructure/database/object-mission/object-mission.repository.ts:18:132
         private readonly missionRepository: Repository<ObjectMissionModel>,
     ) { }
 
-    async getObjectMissionByMissionId(mission_id: string, transactionManager?: EntityManager): Promise<ObjectMissionEntity | null> {
-        return transactionManager ? await transactionManager.findOne(ObjectMissionModel, { where: { mission_id } }) : await this.missionRepository.findOne({ where: { mission_id } });
-    };
+    async getObjectMissionByMissionId(mission_id: string, transactionManager?: EntityManager): Promise<ObjectMissionEntity | null> {};
 
     createObjectMission(object_mission: CreateObjectMissionDTO): ObjectMissionEntity {

[NoCoverage] ObjectLiteral
infrastructure/database/object-mission/object-mission.repository.ts:19:156
     ) { }
 
     async getObjectMissionByMissionId(mission_id: string, transactionManager?: EntityManager): Promise<ObjectMissionEntity | null> {
-        return transactionManager ? await transactionManager.findOne(ObjectMissionModel, { where: { mission_id } }) : await this.missionRepository.findOne({ where: { mission_id } });
+        return transactionManager ? await transactionManager.findOne(ObjectMissionModel, { where: { mission_id } }) : await this.missionRepository.findOne({});
     };
 

[NoCoverage] ObjectLiteral
infrastructure/database/object-mission/object-mission.repository.ts:19:99
     ) { }
 
     async getObjectMissionByMissionId(mission_id: string, transactionManager?: EntityManager): Promise<ObjectMissionEntity | null> {
-        return transactionManager ? await transactionManager.findOne(ObjectMissionModel, { where: { mission_id } }) : await this.missionRepository.findOne({ where: { mission_id } });
+        return transactionManager ? await transactionManager.findOne(ObjectMissionModel, { where: {} }) : await this.missionRepository.findOne({ where: { mission_id } });
     };
 

[NoCoverage] BlockStatement
infrastructure/database/object-mission/object-mission.repository.ts:22:86
         return transactionManager ? await transactionManager.findOne(ObjectMissionModel, { where: { mission_id } }) : await this.missionRepository.findOne({ where: { mission_id } });
     };
 
-    createObjectMission(object_mission: CreateObjectMissionDTO): ObjectMissionEntity {
-        const created_object_mission = this.missionRepository.create(object_mission);
-        return created_object_mission;
-    };
+    createObjectMission(object_mission: CreateObjectMissionDTO): ObjectMissionEntity {};
 
     async saveObjectMission(object_mission: ObjectMissionEntity, category: ObjectMissionCategoryEntity, transactionManager?: EntityManager): Promise<ObjectMissionEntity> {

[NoCoverage] BlockStatement
infrastructure/database/object-mission/object-mission.repository.ts:27:171
         return created_object_mission;
     };
 
-    async saveObjectMission(object_mission: ObjectMissionEntity, category: ObjectMissionCategoryEntity, transactionManager?: EntityManager): Promise<ObjectMissionEntity> {
-        return transactionManager ? await transactionManager.save(ObjectMissionModel, {
-            ...object_mission,
-            object_mission_categories: [category]
-        }) : await this.missionRepository.save({
-            ...object_mission,
-            object_mission_categories: [category]
-        });
-    };
+    async saveObjectMission(object_mission: ObjectMissionEntity, category: ObjectMissionCategoryEntity, transactionManager?: EntityManager): Promise<ObjectMissionEntity> {};
 }

[NoCoverage] ArrayDeclaration
infrastructure/database/object-mission/object-mission.repository.ts:30:40
     async saveObjectMission(object_mission: ObjectMissionEntity, category: ObjectMissionCategoryEntity, transactionManager?: EntityManager): Promise<ObjectMissionEntity> {
         return transactionManager ? await transactionManager.save(ObjectMissionModel, {
             ...object_mission,
-            object_mission_categories: [category]
+            object_mission_categories: []
         }) : await this.missionRepository.save({
             ...object_mission,
