[NoCoverage] BlockStatement
infrastructure/database/object-mission-categories/object-mission-categories.repository.ts:17:77
         private readonly objectMissionCategoryRepository: Repository<ObjectMissionCategoryModel>,
     ) { }
 
-    async getAllObjectMissionCategories(): Promise<MissionCategoryEntity[]> {
-        throw new Error('Method not implemented.');
-    };
+    async getAllObjectMissionCategories(): Promise<MissionCategoryEntity[]> {};
 
     async getCategoryById(category_id: string, transactionManager?: EntityManager): Promise<ObjectMissionCategoryEntity | null> {

[NoCoverage] BlockStatement
infrastructure/database/object-mission-categories/object-mission-categories.repository.ts:21:129
         throw new Error('Method not implemented.');
     };
 
-    async getCategoryById(category_id: string, transactionManager?: EntityManager): Promise<ObjectMissionCategoryEntity | null> {
-        return transactionManager
-            ? await transactionManager.findOne(ObjectMissionCategoryModel, { where: { id: category_id } })
-            : await this.objectMissionCategoryRepository.findOne({ where: { id: category_id } });
-    };
+    async getCategoryById(category_id: string, transactionManager?: EntityManager): Promise<ObjectMissionCategoryEntity | null> {};
 
     async getCategoryByName(category_name: string): Promise<ObjectMissionCategoryEntity | null> {

[NoCoverage] ObjectLiteral
infrastructure/database/object-mission-categories/object-mission-categories.repository.ts:23:85
 
     async getCategoryById(category_id: string, transactionManager?: EntityManager): Promise<ObjectMissionCategoryEntity | null> {
         return transactionManager
-            ? await transactionManager.findOne(ObjectMissionCategoryModel, { where: { id: category_id } })
+            ? await transactionManager.findOne(ObjectMissionCategoryModel, { where: {} })
             : await this.objectMissionCategoryRepository.findOne({ where: { id: category_id } });
     };

[NoCoverage] ObjectLiteral
infrastructure/database/object-mission-categories/object-mission-categories.repository.ts:24:75
     async getCategoryById(category_id: string, transactionManager?: EntityManager): Promise<ObjectMissionCategoryEntity | null> {
         return transactionManager
             ? await transactionManager.findOne(ObjectMissionCategoryModel, { where: { id: category_id } })
-            : await this.objectMissionCategoryRepository.findOne({ where: { id: category_id } });
+            : await this.objectMissionCategoryRepository.findOne({ where: {} });
     };
 

[NoCoverage] BlockStatement
infrastructure/database/object-mission-categories/object-mission-categories.repository.ts:27:97
             : await this.objectMissionCategoryRepository.findOne({ where: { id: category_id } });
     };
 
-    async getCategoryByName(category_name: string): Promise<ObjectMissionCategoryEntity | null> {
-        const category = this.objectMissionCategoryRepository.findOne({
-            where: {
-                category: category_name,
-            }
-        });
-
-        return category;
-    };
+    async getCategoryByName(category_name: string): Promise<ObjectMissionCategoryEntity | null> {};
 
     createObjectMissionCategory(object_mission_category: CreateObjectMissionCategoryDTO): ObjectMissionCategoryEntity {

[NoCoverage] BlockStatement
infrastructure/database/object-mission-categories/object-mission-categories.repository.ts:37:119
         return category;
     };
 
-    createObjectMissionCategory(object_mission_category: CreateObjectMissionCategoryDTO): ObjectMissionCategoryEntity {
-        const created_mission_category = this.objectMissionCategoryRepository.create(object_mission_category);
-        return created_mission_category;
-    };
+    createObjectMissionCategory(object_mission_category: CreateObjectMissionCategoryDTO): ObjectMissionCategoryEntity {};
 
     async saveObjectMissionCategory(mission_category: ObjectMissionCategoryEntity, transactionManager?: EntityManager): Promise<ObjectMissionCategoryEntity> {

[NoCoverage] BlockStatement
infrastructure/database/object-mission-categories/object-mission-categories.repository.ts:42:158
         return created_mission_category;
     };
 
-    async saveObjectMissionCategory(mission_category: ObjectMissionCategoryEntity, transactionManager?: EntityManager): Promise<ObjectMissionCategoryEntity> {
-        return transactionManager ? await transactionManager.save(ObjectMissionCategoryModel, mission_category) : await this.objectMissionCategoryRepository.save(mission_category);
-    };
+    async saveObjectMissionCategory(mission_category: ObjectMissionCategoryEntity, transactionManager?: EntityManager): Promise<ObjectMissionCategoryEntity> {};
 }
