[NoCoverage] BlockStatement
infrastructure/database/person-mission/person-mission.repository.ts:16:132
         private readonly missionRepository: Repository<PersonMissionModel>,
     ) { }
 
-    async getPersonMissionByMissionId(mission_id: string, transactionManager?: EntityManager): Promise<PersonMissionEntity | null> {
-        return transactionManager ? await transactionManager.findOne(PersonMissionModel, { where: { mission_id } }) : await this.missionRepository.findOne({ where: { mission_id } });
-    };
+    async getPersonMissionByMissionId(mission_id: string, transactionManager?: EntityManager): Promise<PersonMissionEntity | null> {};
 
     createPersonMission(person_mission: CreatePersonMissionDTO): PersonMissionEntity {

[NoCoverage] BlockStatement
infrastructure/database/person-mission/person-mission.repository.ts:20:86
         return transactionManager ? await transactionManager.findOne(PersonMissionModel, { where: { mission_id } }) : await this.missionRepository.findOne({ where: { mission_id } });
     };
 
-    createPersonMission(person_mission: CreatePersonMissionDTO): PersonMissionEntity {
-        const created_person_mission = this.missionRepository.create(person_mission);
-        return created_person_mission;
-    };
+    createPersonMission(person_mission: CreatePersonMissionDTO): PersonMissionEntity {};
 
     async savePersonMission(person_mission: PersonMissionEntity, transactionManager?: EntityManager): Promise<PersonMissionEntity> {

[NoCoverage] BlockStatement
infrastructure/database/person-mission/person-mission.repository.ts:25:132
         return created_person_mission;
     };
 
-    async savePersonMission(person_mission: PersonMissionEntity, transactionManager?: EntityManager): Promise<PersonMissionEntity> {
-        return transactionManager ? await transactionManager.save(PersonMissionModel, person_mission) : await this.missionRepository.save(person_mission);
-    };
+    async savePersonMission(person_mission: PersonMissionEntity, transactionManager?: EntityManager): Promise<PersonMissionEntity> {};
 }
