[NoCoverage] BlockStatement
infrastructure/database/pet-mission/pet-mission.repository.ts:16:126
         private readonly petRepository: Repository<PetMissionModel>,
     ) { }
 
-    async getPetMissionByMissionId(mission_id: string, transactionManager?: EntityManager): Promise<PetMissionEntity | null> {
-        return transactionManager ? await transactionManager.findOne(PetMissionModel, { where: { mission_id } }) : await this.petRepository.findOne({ where: { mission_id } });
-    };
+    async getPetMissionByMissionId(mission_id: string, transactionManager?: EntityManager): Promise<PetMissionEntity | null> {};
 
     createPetMission(pet_mission: CreatePetMissionDTO): PetMissionEntity {

[NoCoverage] ObjectLiteral
infrastructure/database/pet-mission/pet-mission.repository.ts:17:149
     ) { }
 
     async getPetMissionByMissionId(mission_id: string, transactionManager?: EntityManager): Promise<PetMissionEntity | null> {
-        return transactionManager ? await transactionManager.findOne(PetMissionModel, { where: { mission_id } }) : await this.petRepository.findOne({ where: { mission_id } });
+        return transactionManager ? await transactionManager.findOne(PetMissionModel, { where: { mission_id } }) : await this.petRepository.findOne({});
     };
 

[NoCoverage] BlockStatement
infrastructure/database/pet-mission/pet-mission.repository.ts:20:74
         return transactionManager ? await transactionManager.findOne(PetMissionModel, { where: { mission_id } }) : await this.petRepository.findOne({ where: { mission_id } });
     };
 
-    createPetMission(pet_mission: CreatePetMissionDTO): PetMissionEntity {
-        const created_pet_mission = this.petRepository.create(pet_mission);
-        return created_pet_mission;
-    };
+    createPetMission(pet_mission: CreatePetMissionDTO): PetMissionEntity {};
 
     async savePetMission(pet_mission: PetMissionEntity, transactionManager?: EntityManager): Promise<PetMissionEntity> {

[NoCoverage] BlockStatement
infrastructure/database/pet-mission/pet-mission.repository.ts:25:120
         return created_pet_mission;
     };
 
-    async savePetMission(pet_mission: PetMissionEntity, transactionManager?: EntityManager): Promise<PetMissionEntity> {
-        return transactionManager ? await transactionManager.save(PetMissionModel, pet_mission) : await this.petRepository.save(pet_mission);
-    };
+    async savePetMission(pet_mission: PetMissionEntity, transactionManager?: EntityManager): Promise<PetMissionEntity> {};
 }
