[NoCoverage] BlockStatement
infrastructure/database/rewards-editions/rewards-editions.repository.ts:16:130
         private readonly rewardsEditionsRepository: Repository<RewardsEditionsModel>,
     ) { }
 
-    async getRewardsEditionByMissionId(mission_id: string, transactionManager?: EntityManager): Promise<RewardsEditionsEntity[]> {
-        return transactionManager ? await transactionManager.find(RewardsEditionsModel, {
-            where: { mission_id }
-        }) : await this.rewardsEditionsRepository.find({ where: { mission_id } });
-    }
+    async getRewardsEditionByMissionId(mission_id: string, transactionManager?: EntityManager): Promise<RewardsEditionsEntity[]> {}
 
     createRewardsEdition(rewardsEditionsEntity: CreateRewarsEditionsDTO): RewardsEditionsEntity {

[NoCoverage] ObjectLiteral
infrastructure/database/rewards-editions/rewards-editions.repository.ts:18:20
 
     async getRewardsEditionByMissionId(mission_id: string, transactionManager?: EntityManager): Promise<RewardsEditionsEntity[]> {
         return transactionManager ? await transactionManager.find(RewardsEditionsModel, {
-            where: { mission_id }
+            where: {}
         }) : await this.rewardsEditionsRepository.find({ where: { mission_id } });
     }

[NoCoverage] BlockStatement
infrastructure/database/rewards-editions/rewards-editions.repository.ts:22:97
         }) : await this.rewardsEditionsRepository.find({ where: { mission_id } });
     }
 
-    createRewardsEdition(rewardsEditionsEntity: CreateRewarsEditionsDTO): RewardsEditionsEntity {
-        const created_rewards_edition = this.rewardsEditionsRepository.create(rewardsEditionsEntity);
-        return created_rewards_edition;
-    };
+    createRewardsEdition(rewardsEditionsEntity: CreateRewarsEditionsDTO): RewardsEditionsEntity {};
 
     async saveRewardsEdition(rewardsEditionsEntity: RewardsEditionsEntity, transactionManager?: EntityManager): Promise<RewardsEditionsEntity> {

[NoCoverage] BlockStatement
infrastructure/database/rewards-editions/rewards-editions.repository.ts:27:144
         return created_rewards_edition;
     };
 
-    async saveRewardsEdition(rewardsEditionsEntity: RewardsEditionsEntity, transactionManager?: EntityManager): Promise<RewardsEditionsEntity> {
-        return transactionManager ? await transactionManager.save(RewardsEditionsModel, rewardsEditionsEntity) : await this.rewardsEditionsRepository.save(rewardsEditionsEntity);
-    };
+    async saveRewardsEdition(rewardsEditionsEntity: RewardsEditionsEntity, transactionManager?: EntityManager): Promise<RewardsEditionsEntity> {};
 }
