[NoCoverage] BlockStatement
infrastructure/database/user/user.repository.ts:16:104
         private readonly userRepository: Repository<UserModel>,
     ) { }
 
-    async getUserById(user_id: string, transactionManager?: EntityManager): Promise<UserEntity | null> {
-        const user = transactionManager ? await transactionManager.findOne(UserModel, {
-            where: {
-                id: user_id
-            }
-        }) : await this.userRepository.findOne({
-            where: {
-                id: user_id
-            }
-        });
-
-        return user;
-    };
+    async getUserById(user_id: string, transactionManager?: EntityManager): Promise<UserEntity | null> {};
 
     async getUserByEmail(email: string): Promise<UserEntity | null> {

[NoCoverage] ObjectLiteral
infrastructure/database/user/user.repository.ts:22:20
                 id: user_id
             }
         }) : await this.userRepository.findOne({
-            where: {
-                id: user_id
-            }
+            where: {}
         });
 

[NoCoverage] BlockStatement
infrastructure/database/user/user.repository.ts:30:69
         return user;
     };
 
-    async getUserByEmail(email: string): Promise<UserEntity | null> {
-        const user = await this.userRepository.findOne({
-            where: {
-                email,
-            }
-        });
-
-        return user;
-    };
+    async getUserByEmail(email: string): Promise<UserEntity | null> {};
 
     async getUserByPhone(phone: string): Promise<UserEntity | null> {

[NoCoverage] ObjectLiteral
infrastructure/database/user/user.repository.ts:31:56
     };
 
     async getUserByEmail(email: string): Promise<UserEntity | null> {
-        const user = await this.userRepository.findOne({
-            where: {
-                email,
-            }
-        });
+        const user = await this.userRepository.findOne({});
 
         return user;

[NoCoverage] BlockStatement
infrastructure/database/user/user.repository.ts:40:69
         return user;
     };
 
-    async getUserByPhone(phone: string): Promise<UserEntity | null> {
-        const user = await this.userRepository.findOne({
-            where: {
-                phone,
-            }
-        });
-
-        return user;
-    };
+    async getUserByPhone(phone: string): Promise<UserEntity | null> {};
 
     async createUser(user: CreateUserDTO): Promise<UserEntity> {

[NoCoverage] ObjectLiteral
infrastructure/database/user/user.repository.ts:41:56
     };
 
     async getUserByPhone(phone: string): Promise<UserEntity | null> {
-        const user = await this.userRepository.findOne({
-            where: {
-                phone,
-            }
-        });
+        const user = await this.userRepository.findOne({});
 
         return user;

[NoCoverage] BlockStatement
infrastructure/database/user/user.repository.ts:50:64
         return user;
     };
 
-    async createUser(user: CreateUserDTO): Promise<UserEntity> {
-        const created_user = this.userRepository.create(user);
-        return created_user;
-    };
+    async createUser(user: CreateUserDTO): Promise<UserEntity> {};
 
     async saveUser(user: UserEntity): Promise<UserEntity> {

[NoCoverage] BlockStatement
infrastructure/database/user/user.repository.ts:55:59
         return created_user;
     };
 
-    async saveUser(user: UserEntity): Promise<UserEntity> {
-        const saved_user = await this.userRepository.save(user);
-        return saved_user;
-    }
+    async saveUser(user: UserEntity): Promise<UserEntity> {}
 };
