[NoCoverage] BlockStatement
src/presentation/mission/mission.controller.ts:18:28
     ) { }
 
     @Get()
-    async getAllMissions() {
-        const missions = await this.getAllMissionsUseCase.execute();
-        return missions;
-    };
+    async getAllMissions() {};
 
     @Post()

[NoCoverage] BlockStatement
src/presentation/mission/mission.controller.ts:24:52
     };
 
     @Post()
-    async createMissions(@Body() body: MissionDTO) {
-        const mission = await this.createMissionUseCase.execute(body);
-        return mission;
-    };
+    async createMissions(@Body() body: MissionDTO) {};
 
     @Patch()

[NoCoverage] BlockStatement
src/presentation/mission/mission.controller.ts:30:57
     };
 
     @Patch()
-    async updateMission(@Body() body: UpdateMissionDTO) {
-        const mission = await this.updateMissionsUseCase.execute(body);
-        return mission;
-    };
+    async updateMission(@Body() body: UpdateMissionDTO) {};
 
     @Patch('rewards')

[NoCoverage] BlockStatement
src/presentation/mission/mission.controller.ts:36:71
     };
 
     @Patch('rewards')
-    async updateMissionRewards(@Body() body: UpdateMissionRewardsDTO) {
-        const mission = await this.updateMissionsRewardsUseCase.execute(body);
-        return mission;
-    };
+    async updateMissionRewards(@Body() body: UpdateMissionRewardsDTO) {};
 }
 
