[NoCoverage] BlockStatement
src/presentation/mission/mission.dto.ts:6:53
 import { CreatePetMissionDTO } from "../pet-mission/pet-mission.dto";
 import { CreateObjectMissionDTO } from "../object-mission/object-mission.dto";
 
-export function AtLeastOne(validationOptions?: any) {
-    return function (object: any, propertyName: string) {
-        registerDecorator({
-            name: 'atLeastOne',
-            target: object.constructor,
-            propertyName: propertyName,
-            options: validationOptions,
-            validator: {
-                validate(value: any) {
-                    const mission_details_person = value[0];
-                    const mission_details_pet = value[1];
-                    const mission_details_object = value[2];
-
-                    if (!mission_details_person && !mission_details_pet && !mission_details_object) return false;
-
-                    return true;
-                },
-                defaultMessage() {
-                    return 'Pelo menos um dos detalhes da missão (pessoa, pet ou objeto) deve ser fornecido.';
-                }
-            }
-        });
-    };
-}
+export function AtLeastOne(validationOptions?: any) {}
 export class CreateMissionDTO {
     @IsNotEmpty({ message: 'Id do usuário é obrigatório.' })

[NoCoverage] BlockStatement
src/presentation/mission/mission.dto.ts:7:57
 import { CreateObjectMissionDTO } from "../object-mission/object-mission.dto";
 
 export function AtLeastOne(validationOptions?: any) {
-    return function (object: any, propertyName: string) {
-        registerDecorator({
-            name: 'atLeastOne',
-            target: object.constructor,
-            propertyName: propertyName,
-            options: validationOptions,
-            validator: {
-                validate(value: any) {
-                    const mission_details_person = value[0];
-                    const mission_details_pet = value[1];
-                    const mission_details_object = value[2];
-
-                    if (!mission_details_person && !mission_details_pet && !mission_details_object) return false;
-
-                    return true;
-                },
-                defaultMessage() {
-                    return 'Pelo menos um dos detalhes da missão (pessoa, pet ou objeto) deve ser fornecido.';
-                }
-            }
-        });
-    };
+    return function (object: any, propertyName: string) {};
 }
 export class CreateMissionDTO {

[NoCoverage] ObjectLiteral
src/presentation/mission/mission.dto.ts:8:27
 
 export function AtLeastOne(validationOptions?: any) {
     return function (object: any, propertyName: string) {
-        registerDecorator({
-            name: 'atLeastOne',
-            target: object.constructor,
-            propertyName: propertyName,
-            options: validationOptions,
-            validator: {
-                validate(value: any) {
-                    const mission_details_person = value[0];
-                    const mission_details_pet = value[1];
-                    const mission_details_object = value[2];
-
-                    if (!mission_details_person && !mission_details_pet && !mission_details_object) return false;
-
-                    return true;
-                },
-                defaultMessage() {
-                    return 'Pelo menos um dos detalhes da missão (pessoa, pet ou objeto) deve ser fornecido.';
-                }
-            }
-        });
+        registerDecorator({});
     };
 }

[NoCoverage] BlockStatement
src/presentation/mission/mission.dto.ts:14:38
             propertyName: propertyName,
             options: validationOptions,
             validator: {
-                validate(value: any) {
-                    const mission_details_person = value[0];
-                    const mission_details_pet = value[1];
-                    const mission_details_object = value[2];
-
-                    if (!mission_details_person && !mission_details_pet && !mission_details_object) return false;
-
-                    return true;
-                },
+                validate(value: any) {},
                 defaultMessage() {
                     return 'Pelo menos um dos detalhes da missão (pessoa, pet ou objeto) deve ser fornecido.';

[NoCoverage] LogicalOperator
src/presentation/mission/mission.dto.ts:19:25
                     const mission_details_pet = value[1];
                     const mission_details_object = value[2];
 
-                    if (!mission_details_person && !mission_details_pet && !mission_details_object) return false;
+                    if (!mission_details_person || !mission_details_pet && !mission_details_object) return false;
 
                     return true;

[NoCoverage] BooleanLiteral
src/presentation/mission/mission.dto.ts:19:25
                     const mission_details_pet = value[1];
                     const mission_details_object = value[2];
 
-                    if (!mission_details_person && !mission_details_pet && !mission_details_object) return false;
+                    if (mission_details_person && !mission_details_pet && !mission_details_object) return false;
 
                     return true;

[NoCoverage] BlockStatement
src/presentation/mission/mission.dto.ts:23:34
 
                     return true;
                 },
-                defaultMessage() {
-                    return 'Pelo menos um dos detalhes da missão (pessoa, pet ou objeto) deve ser fornecido.';
-                }
+                defaultMessage() {}
             }
         });

[NoCoverage] BlockStatement
src/presentation/mission/mission.dto.ts:88:107
     mission_details_object?: CreateObjectMissionDTO;
 
     @AtLeastOne()
-    get MissionDetailsValidation(): [CreatePersonMissionDTO, CreatePetMissionDTO, CreateObjectMissionDTO] {
-        return [this.mission_details_person, this.mission_details_pet, this.mission_details_object];
-    }
+    get MissionDetailsValidation(): [CreatePersonMissionDTO, CreatePetMissionDTO, CreateObjectMissionDTO] {}
 };
 
