[NoCoverage] BlockStatement
src/presentation/mission-categories/mission-categories.controller.ts:14:73
     ) { }
 
     @Post()
-    async createMissionCategory(@Body() body: CreateMissionCategoryDTO) {
-        const mission = await this.createMissionCategoryUseCase.execute(body);
-        return mission;
-    };
+    async createMissionCategory(@Body() body: CreateMissionCategoryDTO) {};
 
     @Patch()

[NoCoverage] BlockStatement
src/presentation/mission-categories/mission-categories.controller.ts:20:73
     };
 
     @Patch()
-    async updateMissionCategory(@Body() body: UpdateMissionCategoryDTO) {
-        const mission = await this.updateMissionCategoryUseCase.execute(body);
-        return mission;
-    };
+    async updateMissionCategory(@Body() body: UpdateMissionCategoryDTO) {};
 }
 
