[NoCoverage] BlockStatement
src/presentation/object-mission-categories/object-mission-categories.controller.ts:14:79
     ) { }
 
     @Post()
-    async createMissionCategory(@Body() body: CreateObjectMissionCategoryDTO) {
-        const object_mission = await this.createObjectMissionCategoryUseCase.execute(body);
-        return object_mission;
-    };
+    async createMissionCategory(@Body() body: CreateObjectMissionCategoryDTO) {};
 
     @Patch()

[NoCoverage] BlockStatement
src/presentation/object-mission-categories/object-mission-categories.controller.ts:20:79
     };
 
     @Patch()
-    async updateMissionCategory(@Body() body: UpdateObjectMissionCategoryDTO) {
-        const object_mission = await this.updateObjectMissionCategoryUseCase.execute(body);
-        return object_mission;
-    };
+    async updateMissionCategory(@Body() body: UpdateObjectMissionCategoryDTO) {};
 }
 
