[NoCoverage] BlockStatement
src/presentation/user/user.controller.ts:14:51
     ) { }
 
     @Post()
-    async createUser(@Body() body: CreateUserDTO) {
-        const user = await this.createUserUseCase.execute(body);
-        return user;
-    };
+    async createUser(@Body() body: CreateUserDTO) {};
 
     @Get(':user_id')

[NoCoverage] BlockStatement
src/presentation/user/user.controller.ts:20:58
     };
 
     @Get(':user_id')
-    async getUserById(@Param('user_id') user_id: string) {
-        const user = await this.getUserByIdUserCase.execute(user_id);
-        return user;
-    };
+    async getUserById(@Param('user_id') user_id: string) {};
 };
