[Killed] BlockStatement
src/domain/mission/mission.service.ts:17:28
     private readonly MIN_REWARD_UPDATE_REAIS = 3;
     constructor(private readonly missionRepository: MissionRepositoryImpl) { }
 
-    async getAllMissions() {
-        const missions = await this.missionRepository.getAllMissions();
-        return missions;
-    }
+    async getAllMissions() {}
 
     async getMissionById(mission_id: string, entityManager?: EntityManager) {
killedBy: MissionService getAllMissions should return all missions
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/domain/mission/mission.service.ts:22:77
         return missions;
     }
 
-    async getMissionById(mission_id: string, entityManager?: EntityManager) {
-        const mission = await this.missionRepository.getMissionById(mission_id, entityManager);
-
-        if (!mission) {
-            throw new NotFoundException(`Missão com id ${mission_id} não encontrada.`);
-        };
-
-        return mission;
-    }
+    async getMissionById(mission_id: string, entityManager?: EntityManager) {}
 
     private convertToCents(current_reward: number): number {
killedBy: MissionService getMissionById should throw NotFoundException if mission is not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/domain/mission/mission.service.ts:25:23
     async getMissionById(mission_id: string, entityManager?: EntityManager) {
         const mission = await this.missionRepository.getMissionById(mission_id, entityManager);
 
-        if (!mission) {
-            throw new NotFoundException(`Missão com id ${mission_id} não encontrada.`);
-        };
+        if (!mission) {};
 
         return mission;
killedBy: MissionService getMissionById should throw NotFoundException if mission is not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] BooleanLiteral
src/domain/mission/mission.service.ts:25:13
     async getMissionById(mission_id: string, entityManager?: EntityManager) {
         const mission = await this.missionRepository.getMissionById(mission_id, entityManager);
 
-        if (!mission) {
+        if (mission) {
             throw new NotFoundException(`Missão com id ${mission_id} não encontrada.`);
         };
killedBy: MissionService getMissionById should throw NotFoundException if mission is not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] BlockStatement
src/domain/mission/mission.service.ts:32:60
         return mission;
     }
 
-    private convertToCents(current_reward: number): number {
-        return Math.round(current_reward * 100);
-    };
+    private convertToCents(current_reward: number): number {};
 
     async createMission(createMissionDTO: CreateMissionDTO, category: MissionCategoryEntity, entityManager?: EntityManager) {
killedBy: MissionService convertToCents should convert a number to cents
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1000
Received: undefined

[Killed] ArithmeticOperator
src/domain/mission/mission.service.ts:33:27
     }
 
     private convertToCents(current_reward: number): number {
-        return Math.round(current_reward * 100);
+        return Math.round(current_reward / 100);
     };
 
killedBy: MissionService convertToCents should convert a number to cents
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1000
Received: 0

[Killed] BlockStatement
src/domain/mission/mission.service.ts:37:68
     };
 
     async createMission(createMissionDTO: CreateMissionDTO, category: MissionCategoryEntity, entityManager?: EntityManager) {
-        if (createMissionDTO.title.length < this.MIN_TITLE_LENGTH) {
-            throw new BadRequestException(`O título da missão deve ter no mínimo ${this.MIN_TITLE_LENGTH} caracteres.`);
-        }
+        if (createMissionDTO.title.length < this.MIN_TITLE_LENGTH) {}
 
         if (createMissionDTO.description.length < this.MIN_DESCRIPTION_LENGTH) {
killedBy: MissionService createMission should throw BadRequestException if title is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
src/domain/mission/mission.service.ts:37:13
     };
 
     async createMission(createMissionDTO: CreateMissionDTO, category: MissionCategoryEntity, entityManager?: EntityManager) {
-        if (createMissionDTO.title.length < this.MIN_TITLE_LENGTH) {
+        if (createMissionDTO.title.length >= this.MIN_TITLE_LENGTH) {
             throw new BadRequestException(`O título da missão deve ter no mínimo ${this.MIN_TITLE_LENGTH} caracteres.`);
         }
killedBy: MissionService createMission should throw BadRequestException if title is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
src/domain/mission/mission.service.ts:41:13
             throw new BadRequestException(`O título da missão deve ter no mínimo ${this.MIN_TITLE_LENGTH} caracteres.`);
         }
 
-        if (createMissionDTO.description.length < this.MIN_DESCRIPTION_LENGTH) {
+        if (createMissionDTO.description.length >= this.MIN_DESCRIPTION_LENGTH) {
             throw new BadRequestException(`A descrição da missão deve ter no mínimo ${this.MIN_DESCRIPTION_LENGTH} caracteres.`);
         }
killedBy: MissionService createMission should throw BadRequestException if description is less than 10 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/mission/mission.service.ts:41:13
             throw new BadRequestException(`O título da missão deve ter no mínimo ${this.MIN_TITLE_LENGTH} caracteres.`);
         }
 
-        if (createMissionDTO.description.length < this.MIN_DESCRIPTION_LENGTH) {
+        if (true) {
             throw new BadRequestException(`A descrição da missão deve ter no mínimo ${this.MIN_DESCRIPTION_LENGTH} caracteres.`);
         }
killedBy: MissionService createMission should throw BadRequestException if current_reward is less than 5 reais
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "A recompensa da missão deve ser no mínimo 5 reais."
Received message:   "A descrição da missão deve ter no mínimo 10 caracteres."

      113 |         } else {
      114 |           stryCov_9fa48("56");
    > 115 |           throw new BadRequestException(stryMutAct_9fa48("57") ? `` : (stryCov_9fa48("57"), `A descrição da missã

[Killed] StringLiteral
src/domain/mission/mission.service.ts:42:43
         }
 
         if (createMissionDTO.description.length < this.MIN_DESCRIPTION_LENGTH) {
-            throw new BadRequestException(`A descrição da missão deve ter no mínimo ${this.MIN_DESCRIPTION_LENGTH} caracteres.`);
+            throw new BadRequestException(``);
         }
 
killedBy: MissionService createMission should throw BadRequestException if description is less than 10 characters
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "A descrição da missão deve ter no mínimo 10 caracteres."
Received message:   "Bad Request"

      113 |         } else {
      114 |           stryCov_9fa48("56");
    > 115 |           throw new BadRequestException(stryMutAct_9fa48("57") ? `` : (stryCov_9fa48("57"), `A descrição da missão deve ter no mínimo ${this.MIN_DESCRIP

[Killed] BlockStatement
src/domain/mission/mission.service.ts:48:47
         const rewardInCents = this.convertToCents(createMissionDTO.current_reward);
         const minRewardInCents = this.convertToCents(this.MIN_REWARD_REAIS);
 
-        if (rewardInCents < minRewardInCents) {
-            throw new BadRequestException(`A recompensa da missão deve ser no mínimo ${this.MIN_REWARD_REAIS} reais.`);
-        };
+        if (rewardInCents < minRewardInCents) {};
 
         if ((createMissionDTO?.latitude && !createMissionDTO?.longitude) || (!createMissionDTO?.latitude && createMissionDTO?.longitude)) {
killedBy: MissionService createMission should throw BadRequestException if current_reward is less than 5 reais
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
src/domain/mission/mission.service.ts:48:13
         const rewardInCents = this.convertToCents(createMissionDTO.current_reward);
         const minRewardInCents = this.convertToCents(this.MIN_REWARD_REAIS);
 
-        if (rewardInCents < minRewardInCents) {
+        if (rewardInCents >= minRewardInCents) {
             throw new BadRequestException(`A recompensa da missão deve ser no mínimo ${this.MIN_REWARD_REAIS} reais.`);
         };
killedBy: MissionService createMission should throw BadRequestException if current_reward is less than 5 reais
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BooleanLiteral
src/domain/mission/mission.service.ts:52:78
             throw new BadRequestException(`A recompensa da missão deve ser no mínimo ${this.MIN_REWARD_REAIS} reais.`);
         };
 
-        if ((createMissionDTO?.latitude && !createMissionDTO?.longitude) || (!createMissionDTO?.latitude && createMissionDTO?.longitude)) {
+        if ((createMissionDTO?.latitude && !createMissionDTO?.longitude) || (createMissionDTO?.latitude && createMissionDTO?.longitude)) {
             throw new BadRequestException('Coordenada inválida.');
         };
killedBy: MissionService createMission should throw BadRequestException if latitude is defined and longitude not
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BooleanLiteral
src/domain/mission/mission.service.ts:52:44
             throw new BadRequestException(`A recompensa da missão deve ser no mínimo ${this.MIN_REWARD_REAIS} reais.`);
         };
 
-        if ((createMissionDTO?.latitude && !createMissionDTO?.longitude) || (!createMissionDTO?.latitude && createMissionDTO?.longitude)) {
+        if ((createMissionDTO?.latitude && createMissionDTO?.longitude) || (!createMissionDTO?.latitude && createMissionDTO?.longitude)) {
             throw new BadRequestException('Coordenada inválida.');
         };
killedBy: MissionService createMission should throw BadRequestException if latitude is defined and latitude not
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/mission/mission.service.ts:56:13
             throw new BadRequestException('Coordenada inválida.');
         };
 
-        if (createMissionDTO.latitude < -90 || createMissionDTO.latitude > 90) {
+        if (true) {
             throw new BadRequestException('Latitude inválida.');
         };
killedBy: MissionService createMission should throw BadRequestException if longitude is less than -180
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Longitude inválida."
Received message:   "Latitude inválida."

      141 |         } else {
      142 |           stryCov_9fa48("89");
    > 143 |           throw new BadRequestException(stryMutAct_9fa48("90") ? "" : (stryCov_9fa48("90"), 'Latitude inválida.'));

[Killed] EqualityOperator
src/domain/mission/mission.service.ts:56:13
             throw new BadRequestException('Coordenada inválida.');
         };
 
-        if (createMissionDTO.latitude < -90 || createMissionDTO.latitude > 90) {
+        if (createMissionDTO.latitude >= -90 || createMissionDTO.latitude > 90) {
             throw new BadRequestException('Latitude inválida.');
         };
killedBy: MissionService createMission should throw BadRequestException if latitude is less than -90
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
src/domain/mission/mission.service.ts:57:43
         };
 
         if (createMissionDTO.latitude < -90 || createMissionDTO.latitude > 90) {
-            throw new BadRequestException('Latitude inválida.');
+            throw new BadRequestException("");
         };
 
killedBy: MissionService createMission should throw BadRequestException if latitude is less than -90
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Latitude inválida."
Received message:   "Bad Request"

      141 |         } else {
      142 |           stryCov_9fa48("89");
    > 143 |           throw new BadRequestException(stryMutAct_9fa48("90") ? "" : (stryCov_9fa48("90"), 'Latitude inválida.'));

[Killed] ConditionalExpression
src/domain/mission/mission.service.ts:60:50
             throw new BadRequestException('Latitude inválida.');
         };
 
-        if (createMissionDTO.longitude < -180 || createMissionDTO.longitude > 180) {
+        if (createMissionDTO.longitude < -180 || false) {
             throw new BadRequestException('Longitude inválida.');
         };
killedBy: MissionService createMission should throw BadRequestException if longitude is upper than 180
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
src/domain/mission/mission.service.ts:60:50
             throw new BadRequestException('Latitude inválida.');
         };
 
-        if (createMissionDTO.longitude < -180 || createMissionDTO.longitude > 180) {
+        if (createMissionDTO.longitude < -180 || createMissionDTO.longitude <= 180) {
             throw new BadRequestException('Longitude inválida.');
         };
killedBy: MissionService createMission should throw BadRequestException if longitude is upper than 180
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
src/domain/mission/mission.service.ts:61:43
         };
 
         if (createMissionDTO.longitude < -180 || createMissionDTO.longitude > 180) {
-            throw new BadRequestException('Longitude inválida.');
+            throw new BadRequestException("");
         };
 
killedBy: MissionService createMission should throw BadRequestException if longitude is less than -180
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Longitude inválida."
Received message:   "Bad Request"

      150 |         } else {
      151 |           stryCov_9fa48("101");
    > 152 |           throw new BadRequestException(stryMutAct_9fa48("102") ? "" : (stryCov_9fa48("102"), 'Longitude inválida.'));

[Killed] BlockStatement
src/domain/mission/mission.service.ts:65:119
         };
 
 
-        if (!Object.values(MissionDetailsType).includes(createMissionDTO.mission_details_type as MissionDetailsType)) {
-            throw new BadRequestException(`Tipo da missão inválido: ${createMissionDTO.mission_details_type}.`);
-        };
+        if (!Object.values(MissionDetailsType).includes(createMissionDTO.mission_details_type as MissionDetailsType)) {};
 
         const created_mission = this.missionRepository.createMission({
killedBy: MissionService createMission should throw BadRequestException if mission_details_type is invalid
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BooleanLiteral
src/domain/mission/mission.service.ts:65:13
         };
 
 
-        if (!Object.values(MissionDetailsType).includes(createMissionDTO.mission_details_type as MissionDetailsType)) {
+        if (Object.values(MissionDetailsType).includes(createMissionDTO.mission_details_type as MissionDetailsType)) {
             throw new BadRequestException(`Tipo da missão inválido: ${createMissionDTO.mission_details_type}.`);
         };
killedBy: MissionService createMission should throw BadRequestException if mission_details_type is invalid
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/mission/mission.service.ts:83:13
     };
 
     async updateMission(updateMissionDTO: UpdateMissionDTO, mission: MissionEntity, entityManager?: EntityManager) {
-        if (updateMissionDTO?.title) {
+        if (false) {
             if (updateMissionDTO.title.length < this.MIN_TITLE_LENGTH) {
                 throw new BadRequestException(`O título da missão deve ter no mínimo ${this.MIN_TITLE_LENGTH} caracteres.`);
killedBy: MissionService updateMission should throw BadRequestException if title is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/domain/mission/mission.service.ts:83:38
     };
 
     async updateMission(updateMissionDTO: UpdateMissionDTO, mission: MissionEntity, entityManager?: EntityManager) {
-        if (updateMissionDTO?.title) {
-            if (updateMissionDTO.title.length < this.MIN_TITLE_LENGTH) {
-                throw new BadRequestException(`O título da missão deve ter no mínimo ${this.MIN_TITLE_LENGTH} caracteres.`);
-            };
-        };
+        if (updateMissionDTO?.title) {};
 
         if (updateMissionDTO?.description) {
killedBy: MissionService updateMission should throw BadRequestException if title is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/domain/mission/mission.service.ts:84:72
 
     async updateMission(updateMissionDTO: UpdateMissionDTO, mission: MissionEntity, entityManager?: EntityManager) {
         if (updateMissionDTO?.title) {
-            if (updateMissionDTO.title.length < this.MIN_TITLE_LENGTH) {
-                throw new BadRequestException(`O título da missão deve ter no mínimo ${this.MIN_TITLE_LENGTH} caracteres.`);
-            };
+            if (updateMissionDTO.title.length < this.MIN_TITLE_LENGTH) {};
         };
 
killedBy: MissionService updateMission should throw BadRequestException if title is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
src/domain/mission/mission.service.ts:84:17
 
     async updateMission(updateMissionDTO: UpdateMissionDTO, mission: MissionEntity, entityManager?: EntityManager) {
         if (updateMissionDTO?.title) {
-            if (updateMissionDTO.title.length < this.MIN_TITLE_LENGTH) {
+            if (updateMissionDTO.title.length >= this.MIN_TITLE_LENGTH) {
                 throw new BadRequestException(`O título da missão deve ter no mínimo ${this.MIN_TITLE_LENGTH} caracteres.`);
             };
killedBy: MissionService updateMission should throw BadRequestException if title is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/domain/mission/mission.service.ts:89:44
             };
         };
 
-        if (updateMissionDTO?.description) {
-            if (updateMissionDTO.description.length < this.MIN_DESCRIPTION_LENGTH) {
-                throw new BadRequestException(`A descrição da missão deve ter no mínimo ${this.MIN_DESCRIPTION_LENGTH} caracteres.`);
-            };
-        };
+        if (updateMissionDTO?.description) {};
 
         if ((updateMissionDTO?.latitude && !updateMissionDTO?.longitude) || (!updateMissionDTO?.latitude && updateMissionDTO?.longitude)) {
killedBy: MissionService updateMission should throw BadRequestException if description is less than 10 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/mission/mission.service.ts:89:13
             };
         };
 
-        if (updateMissionDTO?.description) {
+        if (false) {
             if (updateMissionDTO.description.length < this.MIN_DESCRIPTION_LENGTH) {
                 throw new BadRequestException(`A descrição da missão deve ter no mínimo ${this.MIN_DESCRIPTION_LENGTH} caracteres.`);
killedBy: MissionService updateMission should throw BadRequestException if description is less than 10 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/mission/mission.service.ts:90:17
         };
 
         if (updateMissionDTO?.description) {
-            if (updateMissionDTO.description.length < this.MIN_DESCRIPTION_LENGTH) {
+            if (true) {
                 throw new BadRequestException(`A descrição da missão deve ter no mínimo ${this.MIN_DESCRIPTION_LENGTH} caracteres.`);
             };
killedBy: MissionService updateMission should throw BadRequestException if latitude is defined and latitude not
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Coordenada inválida."
Received message:   "A descrição da missão deve ter no mínimo 10 caracteres."

      206 |             } else {
      207 |               stryCov_9fa48("129");
    > 208 |               throw new BadRequestException(stryMutAct_9fa48("130") ? `` : (stryCov_9fa48("130"), `A descrição da missão deve ter no m

[Killed] ConditionalExpression
src/domain/mission/mission.service.ts:90:17
         };
 
         if (updateMissionDTO?.description) {
-            if (updateMissionDTO.description.length < this.MIN_DESCRIPTION_LENGTH) {
+            if (false) {
                 throw new BadRequestException(`A descrição da missão deve ter no mínimo ${this.MIN_DESCRIPTION_LENGTH} caracteres.`);
             };
killedBy: MissionService updateMission should throw BadRequestException if description is less than 10 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
src/domain/mission/mission.service.ts:91:47
 
         if (updateMissionDTO?.description) {
             if (updateMissionDTO.description.length < this.MIN_DESCRIPTION_LENGTH) {
-                throw new BadRequestException(`A descrição da missão deve ter no mínimo ${this.MIN_DESCRIPTION_LENGTH} caracteres.`);
+                throw new BadRequestException(``);
             };
         };
killedBy: MissionService updateMission should throw BadRequestException if description is less than 10 characters
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "A descrição da missão deve ter no mínimo 10 caracteres."
Received message:   "Bad Request"

      206 |             } else {
      207 |               stryCov_9fa48("129");
    > 208 |               throw new BadRequestException(stryMutAct_9fa48("130") ? `` : (stryCov_9fa48("130"), `A descrição da missão deve ter no mínimo ${t

[Killed] ConditionalExpression
src/domain/mission/mission.service.ts:95:14
             };
         };
 
-        if ((updateMissionDTO?.latitude && !updateMissionDTO?.longitude) || (!updateMissionDTO?.latitude && updateMissionDTO?.longitude)) {
+        if ((false) || (!updateMissionDTO?.latitude && updateMissionDTO?.longitude)) {
             throw new BadRequestException('Coordenada inválida.');
         };
killedBy: MissionService updateMission should throw BadRequestException if latitude is defined and latitude not
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BooleanLiteral
src/domain/mission/mission.service.ts:95:78
             };
         };
 
-        if ((updateMissionDTO?.latitude && !updateMissionDTO?.longitude) || (!updateMissionDTO?.latitude && updateMissionDTO?.longitude)) {
+        if ((updateMissionDTO?.latitude && !updateMissionDTO?.longitude) || (updateMissionDTO?.latitude && updateMissionDTO?.longitude)) {
             throw new BadRequestException('Coordenada inválida.');
         };
killedBy: MissionService updateMission should throw BadRequestException if latitude is defined and longitude not
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/mission/mission.service.ts:99:13
             throw new BadRequestException('Coordenada inválida.');
         };
 
-        if (updateMissionDTO?.latitude) {
+        if (false) {
             if (updateMissionDTO.latitude < -90 || updateMissionDTO.latitude > 90) {
                 throw new BadRequestException('Latitude inválida.');
killedBy: MissionService updateMission should throw BadRequestException if latitude is less than -90
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/domain/mission/mission.service.ts:99:41
             throw new BadRequestException('Coordenada inválida.');
         };
 
-        if (updateMissionDTO?.latitude) {
-            if (updateMissionDTO.latitude < -90 || updateMissionDTO.latitude > 90) {
-                throw new BadRequestException('Latitude inválida.');
-            };
-        };
+        if (updateMissionDTO?.latitude) {};
 
         if (updateMissionDTO?.longitude) {
killedBy: MissionService updateMission should throw BadRequestException if latitude is less than -90
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
src/domain/mission/mission.service.ts:100:52
         };
 
         if (updateMissionDTO?.latitude) {
-            if (updateMissionDTO.latitude < -90 || updateMissionDTO.latitude > 90) {
+            if (updateMissionDTO.latitude < -90 || updateMissionDTO.latitude <= 90) {
                 throw new BadRequestException('Latitude inválida.');
             };
killedBy: MissionService updateMission should throw BadRequestException if latitude is upper than 90
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/mission/mission.service.ts:100:17
         };
 
         if (updateMissionDTO?.latitude) {
-            if (updateMissionDTO.latitude < -90 || updateMissionDTO.latitude > 90) {
+            if (true) {
                 throw new BadRequestException('Latitude inválida.');
             };
killedBy: MissionService updateMission should throw BadRequestException if longitude is less than -180
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Longitude inválida."
Received message:   "Latitude inválida."

      232 |             } else {
      233 |               stryCov_9fa48("160");
    > 234 |               throw new BadRequestException(stryMutAct_9fa48("161") ? "" : (stryCov_9fa48("161"), 'Latitude inválida.'));

[Killed] ConditionalExpression
src/domain/mission/mission.service.ts:105:13
             };
         };
 
-        if (updateMissionDTO?.longitude) {
+        if (false) {
             if (updateMissionDTO.longitude < -180 || updateMissionDTO.longitude > 180) {
                 throw new BadRequestException('Longitude inválida.');
killedBy: MissionService updateMission should throw BadRequestException if longitude is less than -180
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/domain/mission/mission.service.ts:105:42
             };
         };
 
-        if (updateMissionDTO?.longitude) {
-            if (updateMissionDTO.longitude < -180 || updateMissionDTO.longitude > 180) {
-                throw new BadRequestException('Longitude inválida.');
-            };
-        };
+        if (updateMissionDTO?.longitude) {};
 
         mission.title = updateMissionDTO?.title ?? mission.title;
killedBy: MissionService updateMission should throw BadRequestException if longitude is less than -180
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] UnaryOperator
src/domain/mission/mission.service.ts:106:46
         };
 
         if (updateMissionDTO?.longitude) {
-            if (updateMissionDTO.longitude < -180 || updateMissionDTO.longitude > 180) {
+            if (updateMissionDTO.longitude < +180 || updateMissionDTO.longitude > 180) {
                 throw new BadRequestException('Longitude inválida.');
             };
killedBy: MissionService updateMission should update mission successfully
statusReason: BadRequestException: Longitude inválida.
