[Killed] EqualityOperator
src/domain/mission/mission.service.ts:106:17
         };
 
         if (updateMissionDTO?.longitude) {
-            if (updateMissionDTO.longitude < -180 || updateMissionDTO.longitude > 180) {
+            if (updateMissionDTO.longitude >= -180 || updateMissionDTO.longitude > 180) {
                 throw new BadRequestException('Longitude inválida.');
             };
killedBy: MissionService updateMission should throw BadRequestException if longitude is less than -180
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
src/domain/mission/mission.service.ts:107:47
 
         if (updateMissionDTO?.longitude) {
             if (updateMissionDTO.longitude < -180 || updateMissionDTO.longitude > 180) {
-                throw new BadRequestException('Longitude inválida.');
+                throw new BadRequestException("");
             };
         };
killedBy: MissionService updateMission should throw BadRequestException if longitude is less than -180
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Longitude inválida."
Received message:   "Bad Request"

      249 |             } else {
      250 |               stryCov_9fa48("176");
    > 251 |               throw new BadRequestException(stryMutAct_9fa48("177") ? "" : (stryCov_9fa48("177"), 'Longitude inválida.'));

[Survived] OptionalChaining
src/domain/mission/mission.service.ts:111:25
             };
         };
 
-        mission.title = updateMissionDTO?.title ?? mission.title;
+        mission.title = updateMissionDTO.title ?? mission.title;
         mission.description = updateMissionDTO?.description ?? mission.description;
         mission.latitude = updateMissionDTO?.latitude ?? mission.latitude;

[Survived] LogicalOperator
src/domain/mission/mission.service.ts:111:25
             };
         };
 
-        mission.title = updateMissionDTO?.title ?? mission.title;
+        mission.title = updateMissionDTO?.title && mission.title;
         mission.description = updateMissionDTO?.description ?? mission.description;
         mission.latitude = updateMissionDTO?.latitude ?? mission.latitude;

[Survived] LogicalOperator
src/domain/mission/mission.service.ts:112:31
         };
 
         mission.title = updateMissionDTO?.title ?? mission.title;
-        mission.description = updateMissionDTO?.description ?? mission.description;
+        mission.description = updateMissionDTO?.description && mission.description;
         mission.latitude = updateMissionDTO?.latitude ?? mission.latitude;
         mission.longitude = updateMissionDTO?.longitude ?? mission.longitude;

[Survived] OptionalChaining
src/domain/mission/mission.service.ts:112:31
         };
 
         mission.title = updateMissionDTO?.title ?? mission.title;
-        mission.description = updateMissionDTO?.description ?? mission.description;
+        mission.description = updateMissionDTO.description ?? mission.description;
         mission.latitude = updateMissionDTO?.latitude ?? mission.latitude;
         mission.longitude = updateMissionDTO?.longitude ?? mission.longitude;

[Survived] LogicalOperator
src/domain/mission/mission.service.ts:113:28
 
         mission.title = updateMissionDTO?.title ?? mission.title;
         mission.description = updateMissionDTO?.description ?? mission.description;
-        mission.latitude = updateMissionDTO?.latitude ?? mission.latitude;
+        mission.latitude = updateMissionDTO?.latitude && mission.latitude;
         mission.longitude = updateMissionDTO?.longitude ?? mission.longitude;
 

[Survived] OptionalChaining
src/domain/mission/mission.service.ts:113:28
 
         mission.title = updateMissionDTO?.title ?? mission.title;
         mission.description = updateMissionDTO?.description ?? mission.description;
-        mission.latitude = updateMissionDTO?.latitude ?? mission.latitude;
+        mission.latitude = updateMissionDTO.latitude ?? mission.latitude;
         mission.longitude = updateMissionDTO?.longitude ?? mission.longitude;
 

[Survived] OptionalChaining
src/domain/mission/mission.service.ts:114:29
         mission.title = updateMissionDTO?.title ?? mission.title;
         mission.description = updateMissionDTO?.description ?? mission.description;
         mission.latitude = updateMissionDTO?.latitude ?? mission.latitude;
-        mission.longitude = updateMissionDTO?.longitude ?? mission.longitude;
+        mission.longitude = updateMissionDTO.longitude ?? mission.longitude;
 
         const saved_mission = await this.missionRepository.saveMission(mission, entityManager);

[Survived] LogicalOperator
src/domain/mission/mission.service.ts:114:29
         mission.title = updateMissionDTO?.title ?? mission.title;
         mission.description = updateMissionDTO?.description ?? mission.description;
         mission.latitude = updateMissionDTO?.latitude ?? mission.latitude;
-        mission.longitude = updateMissionDTO?.longitude ?? mission.longitude;
+        mission.longitude = updateMissionDTO?.longitude && mission.longitude;
 
         const saved_mission = await this.missionRepository.saveMission(mission, entityManager);

[Killed] BlockStatement
src/domain/mission/mission.service.ts:121:137
         return saved_mission;
     };
 
-    async updateMissionRewards(updateMissionRewardsDTO: UpdateMissionRewardsDTO, mission: MissionEntity, entityManager?: EntityManager) {
-        const new_reward_candidate_in_cents = this.convertToCents(updateMissionRewardsDTO.reward);
-
-        if (new_reward_candidate_in_cents <= mission.current_reward) {
-            throw new BadRequestException(`A recompensa da missão não pode ser diminuída.`);
-        };
-
-        if (new_reward_candidate_in_cents < (mission.current_reward + this.convertToCents(this.MIN_REWARD_UPDATE_REAIS))) {
-            throw new BadRequestException(`Novo valor da recompensa deve ser no mínimo ${this.MIN_REWARD_UPDATE_REAIS} reais maior que o valor atual.`);
-        }
-
-        mission.lowest_reward = mission.initial_reward;
-        mission.current_reward = new_reward_candidate_in_cents;
-
-        const saved_mission = await this.missionRepository.saveMission(mission, entityManager);
-
-        return saved_mission;
-    };
+    async updateMissionRewards(updateMissionRewardsDTO: UpdateMissionRewardsDTO, mission: MissionEntity, entityManager?: EntityManager) {};
 }
killedBy: MissionService updateMissionRewards should throw BadRequestException if mission rewards candidate is lower that the current rewards
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
src/domain/mission/mission.service.ts:124:13
     async updateMissionRewards(updateMissionRewardsDTO: UpdateMissionRewardsDTO, mission: MissionEntity, entityManager?: EntityManager) {
         const new_reward_candidate_in_cents = this.convertToCents(updateMissionRewardsDTO.reward);
 
-        if (new_reward_candidate_in_cents <= mission.current_reward) {
+        if (new_reward_candidate_in_cents > mission.current_reward) {
             throw new BadRequestException(`A recompensa da missão não pode ser diminuída.`);
         };
killedBy: MissionService updateMissionRewards should throw BadRequestException if mission rewards candidate is lower that the current rewards
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "A recompensa da missão não pode ser diminuída."
Received message:   "Novo valor da recompensa deve ser no mínimo 3 reais maior que o valor atual."

      284 |         } else {
      285 |           stryCov_9fa48("198");
    > 286 |           throw new BadRequestException(stryMutAct_9fa48("199") ? `` : (stryCov_9fa48("199"), `

[Killed] ConditionalExpression
src/domain/mission/mission.service.ts:124:13
     async updateMissionRewards(updateMissionRewardsDTO: UpdateMissionRewardsDTO, mission: MissionEntity, entityManager?: EntityManager) {
         const new_reward_candidate_in_cents = this.convertToCents(updateMissionRewardsDTO.reward);
 
-        if (new_reward_candidate_in_cents <= mission.current_reward) {
+        if (false) {
             throw new BadRequestException(`A recompensa da missão não pode ser diminuída.`);
         };
killedBy: MissionService updateMissionRewards should throw BadRequestException if mission rewards candidate is lower that the current rewards
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "A recompensa da missão não pode ser diminuída."
Received message:   "Novo valor da recompensa deve ser no mínimo 3 reais maior que o valor atual."

      284 |         } else {
      285 |           stryCov_9fa48("198");
    > 286 |           throw new BadRequestException(stryMutAct_9fa48("199") ? `` : (stryCov_9fa48("199"), `

[Killed] EqualityOperator
src/domain/mission/mission.service.ts:128:13
             throw new BadRequestException(`A recompensa da missão não pode ser diminuída.`);
         };
 
-        if (new_reward_candidate_in_cents < (mission.current_reward + this.convertToCents(this.MIN_REWARD_UPDATE_REAIS))) {
+        if (new_reward_candidate_in_cents >= mission.current_reward + this.convertToCents(this.MIN_REWARD_UPDATE_REAIS)) {
             throw new BadRequestException(`Novo valor da recompensa deve ser no mínimo ${this.MIN_REWARD_UPDATE_REAIS} reais maior que o valor atual.`);
         }
killedBy: MissionService updateMissionRewards should throw BadRequestException if mission rewards candidate does not reach the new minimum value.
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ArithmeticOperator
src/domain/mission/mission.service.ts:128:46
             throw new BadRequestException(`A recompensa da missão não pode ser diminuída.`);
         };
 
-        if (new_reward_candidate_in_cents < (mission.current_reward + this.convertToCents(this.MIN_REWARD_UPDATE_REAIS))) {
+        if (new_reward_candidate_in_cents < (mission.current_reward - this.convertToCents(this.MIN_REWARD_UPDATE_REAIS))) {
             throw new BadRequestException(`Novo valor da recompensa deve ser no mínimo ${this.MIN_REWARD_UPDATE_REAIS} reais maior que o valor atual.`);
         }
killedBy: MissionService updateMissionRewards should throw BadRequestException if mission rewards candidate does not reach the new minimum value.
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined
