[Killed] BlockStatement
src/domain/mission-categories/mission-categories.service.ts:13:130
     private readonly MIN_CATEGORY_DESCRIPTION_LENGTH = 5;
     constructor(private readonly missionCategoryRepository: MissionCategoriesRepositoryImpl) { }
 
-    async getMissionCategoryById(category_id: string, transactionManager?: EntityManager): Promise<MissionCategoryEntity | null> {
-        const category = await this.missionCategoryRepository.getCategoryById(category_id, transactionManager);
-
-        if (!category) {
-            throw new NotFoundException(`Categoria com id ${category_id} não encontrada.`);
-        };
-
-        return category;
-    };
+    async getMissionCategoryById(category_id: string, transactionManager?: EntityManager): Promise<MissionCategoryEntity | null> {};
 
     // TODO: esclarecer melhor o level da missão e se precisa ser único
killedBy: MissionCategoryService getMissionCategoryById should throw NotFoundException if category id does not exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BooleanLiteral
src/domain/mission-categories/mission-categories.service.ts:16:13
     async getMissionCategoryById(category_id: string, transactionManager?: EntityManager): Promise<MissionCategoryEntity | null> {
         const category = await this.missionCategoryRepository.getCategoryById(category_id, transactionManager);
 
-        if (!category) {
+        if (category) {
             throw new NotFoundException(`Categoria com id ${category_id} não encontrada.`);
         };
killedBy: MissionCategoryService getMissionCategoryById should throw NotFoundException if category id does not exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] StringLiteral
src/domain/mission-categories/mission-categories.service.ts:17:41
         const category = await this.missionCategoryRepository.getCategoryById(category_id, transactionManager);
 
         if (!category) {
-            throw new NotFoundException(`Categoria com id ${category_id} não encontrada.`);
+            throw new NotFoundException(``);
         };
 
killedBy: MissionCategoryService getMissionCategoryById should throw NotFoundException if category id does not exists
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Categoria com id e171bb26-444a-4ffb-b802-595941433460 não encontrada."
Received message:   "Not Found"

      67 |         } else {
      68 |           stryCov_9fa48("204");
    > 69 |           throw new NotFoundException(stryMutAct_9fa48("205") ? `` : (stryCov_9fa48("205"), `Categoria com id ${category_id} não encontrada.`)

[Killed] EqualityOperator
src/domain/mission-categories/mission-categories.service.ts:25:13
 
     // TODO: esclarecer melhor o level da missão e se precisa ser único
     async createMissionCategory(createMissionCategoryDTO: CreateMissionCategoryDTO) {
-        if (createMissionCategoryDTO.category.length < this.MIN_CATEGORY_LENGTH) {
+        if (createMissionCategoryDTO.category.length >= this.MIN_CATEGORY_LENGTH) {
             throw new BadRequestException(`Categoria da missão deve ter no mínimo ${this.MIN_CATEGORY_LENGTH} caracteres.`);
         };
killedBy: MissionCategoryService createCategoryMission should throw BadRequestException if category is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/mission-categories/mission-categories.service.ts:25:13
 
     // TODO: esclarecer melhor o level da missão e se precisa ser único
     async createMissionCategory(createMissionCategoryDTO: CreateMissionCategoryDTO) {
-        if (createMissionCategoryDTO.category.length < this.MIN_CATEGORY_LENGTH) {
+        if (true) {
             throw new BadRequestException(`Categoria da missão deve ter no mínimo ${this.MIN_CATEGORY_LENGTH} caracteres.`);
         };
killedBy: MissionCategoryService createCategoryMission should throw BadRequestException if category description is less than 5 characters
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Descrição da categoria da missão deve ter no mínimo 5 caracteres."
Received message:   "Categoria da missão deve ter no mínimo 3 caracteres."

      85 |         } else {
      86 |           stryCov_9fa48("211");
    > 87 |           throw new BadRequestException(stryMutAct_9fa48("212") ? `` : (stryCov_9fa48("212"), `Categori

[Killed] EqualityOperator
src/domain/mission-categories/mission-categories.service.ts:29:13
             throw new BadRequestException(`Categoria da missão deve ter no mínimo ${this.MIN_CATEGORY_LENGTH} caracteres.`);
         };
 
-        if (createMissionCategoryDTO.description.length < this.MIN_CATEGORY_DESCRIPTION_LENGTH) {
+        if (createMissionCategoryDTO.description.length >= this.MIN_CATEGORY_DESCRIPTION_LENGTH) {
             throw new BadRequestException(`Descrição da categoria da missão deve ter no mínimo ${this.MIN_CATEGORY_DESCRIPTION_LENGTH} caracteres.`);
         };
killedBy: MissionCategoryService createCategoryMission should throw BadRequestException if category description is less than 5 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/mission-categories/mission-categories.service.ts:29:13
             throw new BadRequestException(`Categoria da missão deve ter no mínimo ${this.MIN_CATEGORY_LENGTH} caracteres.`);
         };
 
-        if (createMissionCategoryDTO.description.length < this.MIN_CATEGORY_DESCRIPTION_LENGTH) {
+        if (true) {
             throw new BadRequestException(`Descrição da categoria da missão deve ter no mínimo ${this.MIN_CATEGORY_DESCRIPTION_LENGTH} caracteres.`);
         };
killedBy: MissionCategoryService createCategoryMission should throw BadRequestException if category already exists
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Categoria pet já existe."
Received message:   "Descrição da categoria da missão deve ter no mínimo 5 caracteres."

      94 |         } else {
      95 |           stryCov_9fa48("217");
    > 96 |           throw new BadRequestException(stryMutAct_9fa48("218") ? `` : (stryCov_9fa48("218"), `Descrição da categoria da missão dev

[Killed] BlockStatement
src/domain/mission-categories/mission-categories.service.ts:35:32
 
         const existing_category = await this.missionCategoryRepository.getCategoryByName(createMissionCategoryDTO.category);
 
-        if (existing_category) {
-            throw new BadRequestException(`Categoria ${createMissionCategoryDTO.category} já existe.`);
-        };
+        if (existing_category) {};
 
         const existing_category_level = await this.missionCategoryRepository.getCategoryByLevel(createMissionCategoryDTO.level);
killedBy: MissionCategoryService createCategoryMission should throw BadRequestException if category already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/mission-categories/mission-categories.service.ts:35:13
 
         const existing_category = await this.missionCategoryRepository.getCategoryByName(createMissionCategoryDTO.category);
 
-        if (existing_category) {
+        if (false) {
             throw new BadRequestException(`Categoria ${createMissionCategoryDTO.category} já existe.`);
         };
killedBy: MissionCategoryService createCategoryMission should throw BadRequestException if category already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/domain/mission-categories/mission-categories.service.ts:41:38
 
         const existing_category_level = await this.missionCategoryRepository.getCategoryByLevel(createMissionCategoryDTO.level);
 
-        if (existing_category_level) {
-            throw new BadRequestException(`Categoria com ${createMissionCategoryDTO.level} já existe.`);
-        };
+        if (existing_category_level) {};
 
         const created_mission_category = this.missionCategoryRepository.createCategory(createMissionCategoryDTO);
killedBy: MissionCategoryService createCategoryMission should throw BadRequestException if category level already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/mission-categories/mission-categories.service.ts:41:13
 
         const existing_category_level = await this.missionCategoryRepository.getCategoryByLevel(createMissionCategoryDTO.level);
 
-        if (existing_category_level) {
+        if (true) {
             throw new BadRequestException(`Categoria com ${createMissionCategoryDTO.level} já existe.`);
         };
killedBy: MissionCategoryService createCategoryMission should create and save mission category successfully
statusReason: BadRequestException: Categoria com 2 já existe.

[Killed] BlockStatement
src/domain/mission-categories/mission-categories.service.ts:54:24
     async updateMissionCategory(updateMissionCategoryDTO: UpdateMissionCategoryDTO) {
         const category = await this.missionCategoryRepository.getCategoryById(updateMissionCategoryDTO.category_id);
 
-        if (!category) {
-            throw new NotFoundException(`Categoria com id ${updateMissionCategoryDTO.category_id} não encontrada.`);
-        };
+        if (!category) {};
 
         if (updateMissionCategoryDTO?.category) {
killedBy: MissionCategoryService updateCategoryMission should throw NotFoundException if category id does not exists
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Categoria com id e171bb26-444a-4ffb-b802-595941433460 não encontrada."
Received message:   "Cannot set properties of null (setting 'category')"

      200 |       }
      201 |       ;
    > 202 |       category.category = stryMutAct_9fa48("265") ? updateMissionCategoryDTO?.category && category.category : (stryCov_9fa48("265")

[Killed] StringLiteral
src/domain/mission-categories/mission-categories.service.ts:55:41
         const category = await this.missionCategoryRepository.getCategoryById(updateMissionCategoryDTO.category_id);
 
         if (!category) {
-            throw new NotFoundException(`Categoria com id ${updateMissionCategoryDTO.category_id} não encontrada.`);
+            throw new NotFoundException(``);
         };
 
killedBy: MissionCategoryService updateCategoryMission should throw NotFoundException if category id does not exists
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Categoria com id e171bb26-444a-4ffb-b802-595941433460 não encontrada."
Received message:   "Not Found"

      134 |         } else {
      135 |           stryCov_9fa48("231");
    > 136 |           throw new NotFoundException(stryMutAct_9fa48("232") ? `` : (stryCov_9fa48("232"), `Categoria com id ${updateMissionCategoryDTO.ca

[Killed] ConditionalExpression
src/domain/mission-categories/mission-categories.service.ts:58:13
             throw new NotFoundException(`Categoria com id ${updateMissionCategoryDTO.category_id} não encontrada.`);
         };
 
-        if (updateMissionCategoryDTO?.category) {
+        if (false) {
             if (updateMissionCategoryDTO.category.length < this.MIN_CATEGORY_LENGTH) {
                 throw new BadRequestException(`Categoria da missão deve ter no mínimo ${this.MIN_CATEGORY_LENGTH} caracteres.`);
killedBy: MissionCategoryService updateCategoryMission should throw BadRequestException if category is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/domain/mission-categories/mission-categories.service.ts:58:49
             throw new NotFoundException(`Categoria com id ${updateMissionCategoryDTO.category_id} não encontrada.`);
         };
 
-        if (updateMissionCategoryDTO?.category) {
-            if (updateMissionCategoryDTO.category.length < this.MIN_CATEGORY_LENGTH) {
-                throw new BadRequestException(`Categoria da missão deve ter no mínimo ${this.MIN_CATEGORY_LENGTH} caracteres.`);
-            };
-
-            const existing_category = await this.missionCategoryRepository.getCategoryByName(updateMissionCategoryDTO.category);
-
-            if (existing_category) {
-                throw new BadRequestException(`Categoria ${updateMissionCategoryDTO.category} já existe.`);
-            };
-        };
+        if (updateMissionCategoryDTO?.category) {};
 
         if (updateMissionCategoryDTO?.level) {
killedBy: MissionCategoryService updateCategoryMission should throw BadRequestException if category is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
src/domain/mission-categories/mission-categories.service.ts:59:17
         };
 
         if (updateMissionCategoryDTO?.category) {
-            if (updateMissionCategoryDTO.category.length < this.MIN_CATEGORY_LENGTH) {
+            if (updateMissionCategoryDTO.category.length <= this.MIN_CATEGORY_LENGTH) {
                 throw new BadRequestException(`Categoria da missão deve ter no mínimo ${this.MIN_CATEGORY_LENGTH} caracteres.`);
             };
killedBy: MissionCategoryService updateCategoryMission should throw BadRequestException if category description is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Descrição da categoria da missão deve ter no mínimo 5 caracteres."
Received message:   "Categoria da missão deve ter no mínimo 3 caracteres."

      148 |             } else {
      149 |               stryCov_9fa48("241");
    > 150 |               throw new BadRequestException(stryMutAct_9fa48("242") ? `` : (stryCov_9fa48("2

[Killed] ConditionalExpression
src/domain/mission-categories/mission-categories.service.ts:59:17
         };
 
         if (updateMissionCategoryDTO?.category) {
-            if (updateMissionCategoryDTO.category.length < this.MIN_CATEGORY_LENGTH) {
+            if (false) {
                 throw new BadRequestException(`Categoria da missão deve ter no mínimo ${this.MIN_CATEGORY_LENGTH} caracteres.`);
             };
killedBy: MissionCategoryService updateCategoryMission should throw BadRequestException if category is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
src/domain/mission-categories/mission-categories.service.ts:60:47
 
         if (updateMissionCategoryDTO?.category) {
             if (updateMissionCategoryDTO.category.length < this.MIN_CATEGORY_LENGTH) {
-                throw new BadRequestException(`Categoria da missão deve ter no mínimo ${this.MIN_CATEGORY_LENGTH} caracteres.`);
+                throw new BadRequestException(``);
             };
 
killedBy: MissionCategoryService updateCategoryMission should throw BadRequestException if category is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Categoria da missão deve ter no mínimo 3 caracteres."
Received message:   "Bad Request"

      148 |             } else {
      149 |               stryCov_9fa48("241");
    > 150 |               throw new BadRequestException(stryMutAct_9fa48("242") ? `` : (stryCov_9fa48("242"), `Categoria da missão deve ter no mínimo ${this.M

[Killed] BlockStatement
src/domain/mission-categories/mission-categories.service.ts:65:36
 
             const existing_category = await this.missionCategoryRepository.getCategoryByName(updateMissionCategoryDTO.category);
 
-            if (existing_category) {
-                throw new BadRequestException(`Categoria ${updateMissionCategoryDTO.category} já existe.`);
-            };
+            if (existing_category) {};
         };
 
killedBy: MissionCategoryService updateCategoryMission should throw BadRequestException if category already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/mission-categories/mission-categories.service.ts:70:13
             };
         };
 
-        if (updateMissionCategoryDTO?.level) {
+        if (false) {
             const existing_category_level = await this.missionCategoryRepository.getCategoryByLevel(updateMissionCategoryDTO.level);
 
killedBy: MissionCategoryService updateCategoryMission should throw BadRequestException if category level already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/domain/mission-categories/mission-categories.service.ts:70:46
             };
         };
 
-        if (updateMissionCategoryDTO?.level) {
-            const existing_category_level = await this.missionCategoryRepository.getCategoryByLevel(updateMissionCategoryDTO.level);
-
-            if (existing_category_level) {
-                throw new BadRequestException(`Categoria com ${updateMissionCategoryDTO.level} já existe.`);
-            };
-        };
+        if (updateMissionCategoryDTO?.level) {};
 
         if (updateMissionCategoryDTO?.description) {
killedBy: MissionCategoryService updateCategoryMission should throw BadRequestException if category level already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/domain/mission-categories/mission-categories.service.ts:73:42
         if (updateMissionCategoryDTO?.level) {
             const existing_category_level = await this.missionCategoryRepository.getCategoryByLevel(updateMissionCategoryDTO.level);
 
-            if (existing_category_level) {
-                throw new BadRequestException(`Categoria com ${updateMissionCategoryDTO.level} já existe.`);
-            };
+            if (existing_category_level) {};
         };
 
killedBy: MissionCategoryService updateCategoryMission should throw BadRequestException if category level already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/mission-categories/mission-categories.service.ts:73:17
         if (updateMissionCategoryDTO?.level) {
             const existing_category_level = await this.missionCategoryRepository.getCategoryByLevel(updateMissionCategoryDTO.level);
 
-            if (existing_category_level) {
+            if (false) {
                 throw new BadRequestException(`Categoria com ${updateMissionCategoryDTO.level} já existe.`);
             };
killedBy: MissionCategoryService updateCategoryMission should throw BadRequestException if category level already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/mission-categories/mission-categories.service.ts:78:13
             };
         };
 
-        if (updateMissionCategoryDTO?.description) {
+        if (false) {
             if (updateMissionCategoryDTO.description.length < this.MIN_CATEGORY_DESCRIPTION_LENGTH) {
                 throw new BadRequestException(`Descrição da categoria da missão deve ter no mínimo ${this.MIN_CATEGORY_DESCRIPTION_LENGTH} caracteres.`);
killedBy: MissionCategoryService updateCategoryMission should throw BadRequestException if category description is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/domain/mission-categories/mission-categories.service.ts:78:52
             };
         };
 
-        if (updateMissionCategoryDTO?.description) {
-            if (updateMissionCategoryDTO.description.length < this.MIN_CATEGORY_DESCRIPTION_LENGTH) {
-                throw new BadRequestException(`Descrição da categoria da missão deve ter no mínimo ${this.MIN_CATEGORY_DESCRIPTION_LENGTH} caracteres.`);
-            };
-        };
+        if (updateMissionCategoryDTO?.description) {};
 
         category.category = updateMissionCategoryDTO?.category ?? category.category;
killedBy: MissionCategoryService updateCategoryMission should throw BadRequestException if category description is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
src/domain/mission-categories/mission-categories.service.ts:79:17
         };
 
         if (updateMissionCategoryDTO?.description) {
-            if (updateMissionCategoryDTO.description.length < this.MIN_CATEGORY_DESCRIPTION_LENGTH) {
+            if (updateMissionCategoryDTO.description.length >= this.MIN_CATEGORY_DESCRIPTION_LENGTH) {
                 throw new BadRequestException(`Descrição da categoria da missão deve ter no mínimo ${this.MIN_CATEGORY_DESCRIPTION_LENGTH} caracteres.`);
             };
killedBy: MissionCategoryService updateCategoryMission should throw BadRequestException if category description is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/domain/mission-categories/mission-categories.service.ts:79:101
         };
 
         if (updateMissionCategoryDTO?.description) {
-            if (updateMissionCategoryDTO.description.length < this.MIN_CATEGORY_DESCRIPTION_LENGTH) {
-                throw new BadRequestException(`Descrição da categoria da missão deve ter no mínimo ${this.MIN_CATEGORY_DESCRIPTION_LENGTH} caracteres.`);
-            };
+            if (updateMissionCategoryDTO.description.length < this.MIN_CATEGORY_DESCRIPTION_LENGTH) {};
         };
 
killedBy: MissionCategoryService updateCategoryMission should throw BadRequestException if category description is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] LogicalOperator
src/domain/mission-categories/mission-categories.service.ts:84:29
             };
         };
 
-        category.category = updateMissionCategoryDTO?.category ?? category.category;
+        category.category = updateMissionCategoryDTO?.category && category.category;
         category.description = updateMissionCategoryDTO?.description ?? category.description;
         category.level = updateMissionCategoryDTO?.level ?? category.level;
killedBy: MissionCategoryService updateCategoryMission should update mission category successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,7 +1,7 @@
  Object {
-   "category": "pet",

[Survived] OptionalChaining
src/domain/mission-categories/mission-categories.service.ts:84:29
             };
         };
 
-        category.category = updateMissionCategoryDTO?.category ?? category.category;
+        category.category = updateMissionCategoryDTO.category ?? category.category;
         category.description = updateMissionCategoryDTO?.description ?? category.description;
         category.level = updateMissionCategoryDTO?.level ?? category.level;

[Survived] LogicalOperator
src/domain/mission-categories/mission-categories.service.ts:85:32
         };
 
         category.category = updateMissionCategoryDTO?.category ?? category.category;
-        category.description = updateMissionCategoryDTO?.description ?? category.description;
+        category.description = updateMissionCategoryDTO?.description && category.description;
         category.level = updateMissionCategoryDTO?.level ?? category.level;
 

[Survived] OptionalChaining
src/domain/mission-categories/mission-categories.service.ts:85:32
         };
 
         category.category = updateMissionCategoryDTO?.category ?? category.category;
-        category.description = updateMissionCategoryDTO?.description ?? category.description;
+        category.description = updateMissionCategoryDTO.description ?? category.description;
         category.level = updateMissionCategoryDTO?.level ?? category.level;
 

[Survived] OptionalChaining
src/domain/mission-categories/mission-categories.service.ts:86:26
 
         category.category = updateMissionCategoryDTO?.category ?? category.category;
         category.description = updateMissionCategoryDTO?.description ?? category.description;
-        category.level = updateMissionCategoryDTO?.level ?? category.level;
+        category.level = updateMissionCategoryDTO.level ?? category.level;
 
         const updated_category = await this.missionCategoryRepository.saveCategory(category);

[Survived] LogicalOperator
src/domain/mission-categories/mission-categories.service.ts:86:26
 
         category.category = updateMissionCategoryDTO?.category ?? category.category;
         category.description = updateMissionCategoryDTO?.description ?? category.description;
-        category.level = updateMissionCategoryDTO?.level ?? category.level;
+        category.level = updateMissionCategoryDTO?.level && category.level;
 
         const updated_category = await this.missionCategoryRepository.saveCategory(category);
