[Killed] BlockStatement
src/domain/object-mission/object-mission.service.ts:13:59
     private readonly MIN_OBJECT_DESCRIPTION_LENGTH = 6;
     constructor(private readonly personMissionRepository: ObjectMissionRepositoryImpl) { }
 
-    async getObjectMissionByMissionId(mission_id: string) {
-        const object_mission = await this.personMissionRepository.getObjectMissionByMissionId(mission_id);
-
-        if (!object_mission) {
-            throw new NotFoundException(`Objeto de missão ${mission_id} não encontrado.`);
-        };
-
-        return object_mission;
-    }
+    async getObjectMissionByMissionId(mission_id: string) {}
 
     async createObjectMission(createObjectMissionDTO: CreateObjectMissionDTO, mission_id: string, category: ObjectMissionCategoryEntity, transactionManager?: EntityManager) {
killedBy: ObjectMissionService getObjectMissionByMissionId should throw NotFoundException if mission object category id does not exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/object-mission/object-mission.service.ts:16:13
     async getObjectMissionByMissionId(mission_id: string) {
         const object_mission = await this.personMissionRepository.getObjectMissionByMissionId(mission_id);
 
-        if (!object_mission) {
+        if (false) {
             throw new NotFoundException(`Objeto de missão ${mission_id} não encontrado.`);
         };
killedBy: ObjectMissionService getObjectMissionByMissionId should throw NotFoundException if mission object category id does not exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] ConditionalExpression
src/domain/object-mission/object-mission.service.ts:16:13
     async getObjectMissionByMissionId(mission_id: string) {
         const object_mission = await this.personMissionRepository.getObjectMissionByMissionId(mission_id);
 
-        if (!object_mission) {
+        if (true) {
             throw new NotFoundException(`Objeto de missão ${mission_id} não encontrado.`);
         };
killedBy: ObjectMissionService getObjectMissionByMissionId should return mission object category successfully
statusReason: NotFoundException: Objeto de missão e171bb26-444a-4ffb-b802-595941433460 não encontrado.

[Killed] BlockStatement
src/domain/object-mission/object-mission.service.ts:23:174
         return object_mission;
     }
 
-    async createObjectMission(createObjectMissionDTO: CreateObjectMissionDTO, mission_id: string, category: ObjectMissionCategoryEntity, transactionManager?: EntityManager) {
-        if (createObjectMissionDTO.object_name.length < this.MIN_OBJECT_NAME_LENGTH) {
-            throw new BadRequestException(`Nome do objeto deve ter no mínimo ${this.MIN_OBJECT_NAME_LENGTH} caracteres.`);
-        };
-
-        if (createObjectMissionDTO.description.length < this.MIN_OBJECT_DESCRIPTION_LENGTH) {
-            throw new BadRequestException(`Descrição do objeto deve ter no mínimo ${this.MIN_OBJECT_DESCRIPTION_LENGTH} caracteres.`);
-        };
-
-        const created_object_mission = this.personMissionRepository.createObjectMission(createObjectMissionDTO);
-
-        const saved_object_mission = await this.personMissionRepository.saveObjectMission({
-            ...created_object_mission,
-            mission_id
-        }, category, transactionManager);
-
-        return saved_object_mission;
-    };
+    async createObjectMission(createObjectMissionDTO: CreateObjectMissionDTO, mission_id: string, category: ObjectMissionCategoryEntity, transactionManager?: EntityManager) {};
 }
killedBy: ObjectMissionService createObjectMission should throw BadRequestException if object name is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
src/domain/object-mission/object-mission.service.ts:24:13
     }
 
     async createObjectMission(createObjectMissionDTO: CreateObjectMissionDTO, mission_id: string, category: ObjectMissionCategoryEntity, transactionManager?: EntityManager) {
-        if (createObjectMissionDTO.object_name.length < this.MIN_OBJECT_NAME_LENGTH) {
+        if (createObjectMissionDTO.object_name.length >= this.MIN_OBJECT_NAME_LENGTH) {
             throw new BadRequestException(`Nome do objeto deve ter no mínimo ${this.MIN_OBJECT_NAME_LENGTH} caracteres.`);
         };
killedBy: ObjectMissionService createObjectMission should throw BadRequestException if object name is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/object-mission/object-mission.service.ts:24:13
     }
 
     async createObjectMission(createObjectMissionDTO: CreateObjectMissionDTO, mission_id: string, category: ObjectMissionCategoryEntity, transactionManager?: EntityManager) {
-        if (createObjectMissionDTO.object_name.length < this.MIN_OBJECT_NAME_LENGTH) {
+        if (true) {
             throw new BadRequestException(`Nome do objeto deve ter no mínimo ${this.MIN_OBJECT_NAME_LENGTH} caracteres.`);
         };
killedBy: ObjectMissionService createObjectMission should throw BadRequestException if object description is less than 6 characters
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Descrição do objeto deve ter no mínimo 6 caracteres."
Received message:   "Nome do objeto deve ter no mínimo 3 caracteres."

      84 |         } else {
      85 |           stryCov_9fa48("282");
    > 86 |           throw new BadRequestException(stryMutAct_9fa48("283") ? `` : (stryCov_9fa48("283"), `Nome do objeto deve ter no

[Killed] ConditionalExpression
src/domain/object-mission/object-mission.service.ts:28:13
             throw new BadRequestException(`Nome do objeto deve ter no mínimo ${this.MIN_OBJECT_NAME_LENGTH} caracteres.`);
         };
 
-        if (createObjectMissionDTO.description.length < this.MIN_OBJECT_DESCRIPTION_LENGTH) {
+        if (false) {
             throw new BadRequestException(`Descrição do objeto deve ter no mínimo ${this.MIN_OBJECT_DESCRIPTION_LENGTH} caracteres.`);
         };
killedBy: ObjectMissionService createObjectMission should throw BadRequestException if object description is less than 6 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
src/domain/object-mission/object-mission.service.ts:28:13
             throw new BadRequestException(`Nome do objeto deve ter no mínimo ${this.MIN_OBJECT_NAME_LENGTH} caracteres.`);
         };
 
-        if (createObjectMissionDTO.description.length < this.MIN_OBJECT_DESCRIPTION_LENGTH) {
+        if (createObjectMissionDTO.description.length >= this.MIN_OBJECT_DESCRIPTION_LENGTH) {
             throw new BadRequestException(`Descrição do objeto deve ter no mínimo ${this.MIN_OBJECT_DESCRIPTION_LENGTH} caracteres.`);
         };
killedBy: ObjectMissionService createObjectMission should throw BadRequestException if object description is less than 6 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] ObjectLiteral
src/domain/object-mission/object-mission.service.ts:34:91
 
         const created_object_mission = this.personMissionRepository.createObjectMission(createObjectMissionDTO);
 
-        const saved_object_mission = await this.personMissionRepository.saveObjectMission({
-            ...created_object_mission,
-            mission_id
-        }, category, transactionManager);
+        const saved_object_mission = await this.personMissionRepository.saveObjectMission({}, category, transactionManager);
 
         return saved_object_mission;
