[Killed] BlockStatement
src/domain/object-mission-categories/object-mission-categories.service.ts:13:136
     private readonly MIN_CATEGORY_DESCRIPTION_LENGTH = 5;
     constructor(private readonly objectMissionCategoryRepository: ObjectMissionCategoryRepositoryImpl) { }
 
-    async getMissionCategoryById(category_id: string, transactionManager?: EntityManager): Promise<ObjectMissionCategoryEntity | null> {
-        const category = await this.objectMissionCategoryRepository.getCategoryById(category_id, transactionManager);
-
-        if (!category) {
-            throw new NotFoundException(`Categoria com id ${category_id} não encontrada.`);
-        };
-
-        return category;
-    };
+    async getMissionCategoryById(category_id: string, transactionManager?: EntityManager): Promise<ObjectMissionCategoryEntity | null> {};
 
     async createObjectMissionCategory(createObjectMissionCategoryDTO: CreateObjectMissionCategoryDTO) {
killedBy: ObjectMissionCategoriesService getMissionCategoryById should return a category
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"category": "category", "description": "description", "id": "e171bb26-444a-4ffb-b802-595941433460"}
Received: undefined

[Killed] BlockStatement
src/domain/object-mission-categories/object-mission-categories.service.ts:16:24
     async getMissionCategoryById(category_id: string, transactionManager?: EntityManager): Promise<ObjectMissionCategoryEntity | null> {
         const category = await this.objectMissionCategoryRepository.getCategoryById(category_id, transactionManager);
 
-        if (!category) {
-            throw new NotFoundException(`Categoria com id ${category_id} não encontrada.`);
-        };
+        if (!category) {};
 
         return category;
killedBy: ObjectMissionCategoriesService getMissionCategoryById should throw an error if category is not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] BlockStatement
src/domain/object-mission-categories/object-mission-categories.service.ts:23:103
         return category;
     };
 
-    async createObjectMissionCategory(createObjectMissionCategoryDTO: CreateObjectMissionCategoryDTO) {
-        if (createObjectMissionCategoryDTO.category.length < this.MIN_CATEGORY_LENGTH) {
-            throw new BadRequestException(`Categoria do objeto deve ter no mínimo ${this.MIN_CATEGORY_LENGTH} caracteres.`);
-        };
-
-        if (createObjectMissionCategoryDTO.description.length < this.MIN_CATEGORY_DESCRIPTION_LENGTH) {
-            throw new BadRequestException(`Descrição da categoria do objeto deve ter no mínimo ${this.MIN_CATEGORY_DESCRIPTION_LENGTH} caracteres.`);
-        };
-
-        const existing_category = await this.objectMissionCategoryRepository.getCategoryByName(createObjectMissionCategoryDTO.category);
-
-        if (existing_category) {
-            throw new BadRequestException(`Categoria ${createObjectMissionCategoryDTO.category} já existe.`);
-        };
-
-        const created_object_mission_category = this.objectMissionCategoryRepository.createObjectMissionCategory(createObjectMissionCategoryDTO);
-        const saved_object_mission_category = await this.objectMissionCategoryRepository.saveObjectMissionCategory(created_object_mission_category);
-
-        return saved_object_mission_category;
-    };
+    async createObjectMissionCategory(createObjectMissionCategoryDTO: CreateObjectMissionCategoryDTO) {};
 
     async updateObjectMissionCategory(updateObjectMissionCategoryDTO: UpdateObjectMissionCategoryDTO) {
killedBy: ObjectMissionCategoriesService createObjectMissionCategory should throw an error if category name already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/object-mission-categories/object-mission-categories.service.ts:24:13
     };
 
     async createObjectMissionCategory(createObjectMissionCategoryDTO: CreateObjectMissionCategoryDTO) {
-        if (createObjectMissionCategoryDTO.category.length < this.MIN_CATEGORY_LENGTH) {
+        if (true) {
             throw new BadRequestException(`Categoria do objeto deve ter no mínimo ${this.MIN_CATEGORY_LENGTH} caracteres.`);
         };
killedBy: ObjectMissionCategoriesService createObjectMissionCategory should throw an error if category name already exists
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Categoria category já existe."
Received message:   "Categoria do objeto deve ter no mínimo 3 caracteres."

      84 |         } else {
      85 |           stryCov_9fa48("302");
    > 86 |           throw new BadRequestException(stryMutAct_9fa48("303") ? `` : (stryCov_9fa48("303"), `Categoria do objeto deve ter no mínimo ${thi

[Killed] ConditionalExpression
src/domain/object-mission-categories/object-mission-categories.service.ts:24:13
     };
 
     async createObjectMissionCategory(createObjectMissionCategoryDTO: CreateObjectMissionCategoryDTO) {
-        if (createObjectMissionCategoryDTO.category.length < this.MIN_CATEGORY_LENGTH) {
+        if (false) {
             throw new BadRequestException(`Categoria do objeto deve ter no mínimo ${this.MIN_CATEGORY_LENGTH} caracteres.`);
         };
killedBy: ObjectMissionCategoriesService createObjectMissionCategory should throw an error if category name is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
src/domain/object-mission-categories/object-mission-categories.service.ts:25:43
 
     async createObjectMissionCategory(createObjectMissionCategoryDTO: CreateObjectMissionCategoryDTO) {
         if (createObjectMissionCategoryDTO.category.length < this.MIN_CATEGORY_LENGTH) {
-            throw new BadRequestException(`Categoria do objeto deve ter no mínimo ${this.MIN_CATEGORY_LENGTH} caracteres.`);
+            throw new BadRequestException(``);
         };
 
killedBy: ObjectMissionCategoriesService createObjectMissionCategory should throw an error if category name is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Categoria do objeto deve ter no mínimo 3 caracteres."
Received message:   "Bad Request"

      84 |         } else {
      85 |           stryCov_9fa48("302");
    > 86 |           throw new BadRequestException(stryMutAct_9fa48("303") ? `` : (stryCov_9fa48("303"), `Categoria do objeto deve ter no mínimo ${this.MIN_CATEGORY_LEN

[Killed] EqualityOperator
src/domain/object-mission-categories/object-mission-categories.service.ts:28:13
             throw new BadRequestException(`Categoria do objeto deve ter no mínimo ${this.MIN_CATEGORY_LENGTH} caracteres.`);
         };
 
-        if (createObjectMissionCategoryDTO.description.length < this.MIN_CATEGORY_DESCRIPTION_LENGTH) {
+        if (createObjectMissionCategoryDTO.description.length >= this.MIN_CATEGORY_DESCRIPTION_LENGTH) {
             throw new BadRequestException(`Descrição da categoria do objeto deve ter no mínimo ${this.MIN_CATEGORY_DESCRIPTION_LENGTH} caracteres.`);
         };
killedBy: ObjectMissionCategoriesService createObjectMissionCategory should throw an error if category name already exists
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Categoria category já existe."
Received message:   "Descrição da categoria do objeto deve ter no mínimo 5 caracteres."

      93 |         } else {
      94 |           stryCov_9fa48("308");
    > 95 |           throw new BadRequestException(stryMutAct_9fa48("309") ? `` : (stryCov_9fa48("309"), `Descrição da categoria do objet

[Killed] ConditionalExpression
src/domain/object-mission-categories/object-mission-categories.service.ts:28:13
             throw new BadRequestException(`Categoria do objeto deve ter no mínimo ${this.MIN_CATEGORY_LENGTH} caracteres.`);
         };
 
-        if (createObjectMissionCategoryDTO.description.length < this.MIN_CATEGORY_DESCRIPTION_LENGTH) {
+        if (true) {
             throw new BadRequestException(`Descrição da categoria do objeto deve ter no mínimo ${this.MIN_CATEGORY_DESCRIPTION_LENGTH} caracteres.`);
         };
killedBy: ObjectMissionCategoriesService createObjectMissionCategory should throw an error if category name already exists
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Categoria category já existe."
Received message:   "Descrição da categoria do objeto deve ter no mínimo 5 caracteres."

      93 |         } else {
      94 |           stryCov_9fa48("308");
    > 95 |           throw new BadRequestException(stryMutAct_9fa48("309") ? `` : (stryCov_9fa48("309"), `Descrição da categoria do objet

[Killed] ConditionalExpression
src/domain/object-mission-categories/object-mission-categories.service.ts:34:13
 
         const existing_category = await this.objectMissionCategoryRepository.getCategoryByName(createObjectMissionCategoryDTO.category);
 
-        if (existing_category) {
+        if (true) {
             throw new BadRequestException(`Categoria ${createObjectMissionCategoryDTO.category} já existe.`);
         };
killedBy: ObjectMissionCategoriesService createObjectMissionCategory should create a category successfuly
statusReason: BadRequestException: Categoria category já existe.

[Killed] BlockStatement
src/domain/object-mission-categories/object-mission-categories.service.ts:51:55
             throw new NotFoundException(`Categoria com id ${updateObjectMissionCategoryDTO.category_id} não encontrada.`);
         };
 
-        if (updateObjectMissionCategoryDTO?.category) {
-            if (updateObjectMissionCategoryDTO.category.length < this.MIN_CATEGORY_LENGTH) {
-                throw new BadRequestException(`Categoria do objeto deve ter no mínimo ${this.MIN_CATEGORY_LENGTH} caracteres.`);
-            };
-
-            const existing_category = await this.objectMissionCategoryRepository.getCategoryByName(updateObjectMissionCategoryDTO.category);
-
-            if (existing_category) {
-                throw new BadRequestException(`Categoria ${updateObjectMissionCategoryDTO.category} já existe.`);
-            };
-        };
+        if (updateObjectMissionCategoryDTO?.category) {};
 
         if (updateObjectMissionCategoryDTO?.description) {
killedBy: ObjectMissionCategoriesService updateObjectMissionCategory should throw an error if category name already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/object-mission-categories/object-mission-categories.service.ts:51:13
             throw new NotFoundException(`Categoria com id ${updateObjectMissionCategoryDTO.category_id} não encontrada.`);
         };
 
-        if (updateObjectMissionCategoryDTO?.category) {
+        if (false) {
             if (updateObjectMissionCategoryDTO.category.length < this.MIN_CATEGORY_LENGTH) {
                 throw new BadRequestException(`Categoria do objeto deve ter no mínimo ${this.MIN_CATEGORY_LENGTH} caracteres.`);
killedBy: ObjectMissionCategoriesService updateObjectMissionCategory should throw an error if category name already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/object-mission-categories/object-mission-categories.service.ts:52:17
         };
 
         if (updateObjectMissionCategoryDTO?.category) {
-            if (updateObjectMissionCategoryDTO.category.length < this.MIN_CATEGORY_LENGTH) {
+            if (true) {
                 throw new BadRequestException(`Categoria do objeto deve ter no mínimo ${this.MIN_CATEGORY_LENGTH} caracteres.`);
             };
killedBy: ObjectMissionCategoriesService updateObjectMissionCategory should throw an error if category name already exists
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Categoria category já existe."
Received message:   "Categoria do objeto deve ter no mínimo 3 caracteres."

      137 |             } else {
      138 |               stryCov_9fa48("328");
    > 139 |               throw new BadRequestException(stryMutAct_9fa48("329") ? `` : (stryCov_9fa48("329"), `Categoria do objeto deve ter

[Killed] EqualityOperator
src/domain/object-mission-categories/object-mission-categories.service.ts:52:17
         };
 
         if (updateObjectMissionCategoryDTO?.category) {
-            if (updateObjectMissionCategoryDTO.category.length < this.MIN_CATEGORY_LENGTH) {
+            if (updateObjectMissionCategoryDTO.category.length >= this.MIN_CATEGORY_LENGTH) {
                 throw new BadRequestException(`Categoria do objeto deve ter no mínimo ${this.MIN_CATEGORY_LENGTH} caracteres.`);
             };
killedBy: ObjectMissionCategoriesService updateObjectMissionCategory should throw an error if category name already exists
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Categoria category já existe."
Received message:   "Categoria do objeto deve ter no mínimo 3 caracteres."

      137 |             } else {
      138 |               stryCov_9fa48("328");
    > 139 |               throw new BadRequestException(stryMutAct_9fa48("329") ? `` : (stryCov_9fa48("329"), `Categoria do objeto deve ter

[Killed] StringLiteral
src/domain/object-mission-categories/object-mission-categories.service.ts:53:47
 
         if (updateObjectMissionCategoryDTO?.category) {
             if (updateObjectMissionCategoryDTO.category.length < this.MIN_CATEGORY_LENGTH) {
-                throw new BadRequestException(`Categoria do objeto deve ter no mínimo ${this.MIN_CATEGORY_LENGTH} caracteres.`);
+                throw new BadRequestException(``);
             };
 
killedBy: ObjectMissionCategoriesService updateObjectMissionCategory should throw an error if category name is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Categoria do objeto deve ter no mínimo 3 caracteres."
Received message:   "Bad Request"

      137 |             } else {
      138 |               stryCov_9fa48("328");
    > 139 |               throw new BadRequestException(stryMutAct_9fa48("329") ? `` : (stryCov_9fa48("329"), `Categoria do objeto deve ter no mínimo ${this.M

[Killed] ConditionalExpression
src/domain/object-mission-categories/object-mission-categories.service.ts:63:13
             };
         };
 
-        if (updateObjectMissionCategoryDTO?.description) {
+        if (false) {
             if (updateObjectMissionCategoryDTO.description.length < this.MIN_CATEGORY_DESCRIPTION_LENGTH) {
                 throw new BadRequestException(`Descrição da categoria do objeto deve ter no mínimo ${this.MIN_CATEGORY_DESCRIPTION_LENGTH} caracteres.`);
killedBy: ObjectMissionCategoriesService updateObjectMissionCategory should throw an error if category description is less than 5 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/object-mission-categories/object-mission-categories.service.ts:63:13
             };
         };
 
-        if (updateObjectMissionCategoryDTO?.description) {
+        if (true) {
             if (updateObjectMissionCategoryDTO.description.length < this.MIN_CATEGORY_DESCRIPTION_LENGTH) {
                 throw new BadRequestException(`Descrição da categoria do objeto deve ter no mínimo ${this.MIN_CATEGORY_DESCRIPTION_LENGTH} caracteres.`);
killedBy: ObjectMissionCategoriesService updateObjectMissionCategory should update a category successfuly
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/domain/object-mission-categories/object-mission-categories.service.ts:64:17
         };
 
         if (updateObjectMissionCategoryDTO?.description) {
-            if (updateObjectMissionCategoryDTO.description.length < this.MIN_CATEGORY_DESCRIPTION_LENGTH) {
+            if (false) {
                 throw new BadRequestException(`Descrição da categoria do objeto deve ter no mínimo ${this.MIN_CATEGORY_DESCRIPTION_LENGTH} caracteres.`);
             };
killedBy: ObjectMissionCategoriesService updateObjectMissionCategory should throw an error if category description is less than 5 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
src/domain/object-mission-categories/object-mission-categories.service.ts:64:17
         };
 
         if (updateObjectMissionCategoryDTO?.description) {
-            if (updateObjectMissionCategoryDTO.description.length < this.MIN_CATEGORY_DESCRIPTION_LENGTH) {
+            if (updateObjectMissionCategoryDTO.description.length >= this.MIN_CATEGORY_DESCRIPTION_LENGTH) {
                 throw new BadRequestException(`Descrição da categoria do objeto deve ter no mínimo ${this.MIN_CATEGORY_DESCRIPTION_LENGTH} caracteres.`);
             };
killedBy: ObjectMissionCategoriesService updateObjectMissionCategory should throw an error if category description is less than 5 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] LogicalOperator
src/domain/object-mission-categories/object-mission-categories.service.ts:69:29
             };
         };
 
-        category.category = updateObjectMissionCategoryDTO?.category ?? category.category;
+        category.category = updateObjectMissionCategoryDTO?.category && category.category;
         category.description = updateObjectMissionCategoryDTO?.description ?? category.description;
 

[Survived] OptionalChaining
src/domain/object-mission-categories/object-mission-categories.service.ts:69:29
             };
         };
 
-        category.category = updateObjectMissionCategoryDTO?.category ?? category.category;
+        category.category = updateObjectMissionCategoryDTO.category ?? category.category;
         category.description = updateObjectMissionCategoryDTO?.description ?? category.description;
 

[Survived] LogicalOperator
src/domain/object-mission-categories/object-mission-categories.service.ts:70:32
         };
 
         category.category = updateObjectMissionCategoryDTO?.category ?? category.category;
-        category.description = updateObjectMissionCategoryDTO?.description ?? category.description;
+        category.description = updateObjectMissionCategoryDTO?.description && category.description;
 
         const updated_category = await this.objectMissionCategoryRepository.saveObjectMissionCategory(category);

[Survived] OptionalChaining
src/domain/object-mission-categories/object-mission-categories.service.ts:70:32
         };
 
         category.category = updateObjectMissionCategoryDTO?.category ?? category.category;
-        category.description = updateObjectMissionCategoryDTO?.description ?? category.description;
+        category.description = updateObjectMissionCategoryDTO.description ?? category.description;
 
         const updated_category = await this.objectMissionCategoryRepository.saveObjectMissionCategory(category);
