[Killed] BlockStatement
src/domain/person-mission/person-mission.service.ts:13:59
     private readonly MIN_NAME_PERSON_LENGTH = 3;
     constructor(private readonly personMissionRepository: PersonMissionRepositoryImpl) { }
 
-    async getPersonMissionByMissionId(mission_id: string) {
-        const person_mission = await this.personMissionRepository.getPersonMissionByMissionId(mission_id);
-
-        if (!person_mission) {
-            throw new BadRequestException(`Missão com id ${mission_id} não encontrada.`);
-        };
-
-        return person_mission;
-    }
+    async getPersonMissionByMissionId(mission_id: string) {}
 
     async createPersonMission(createPersonMissionDTO: CreatePersonMissionDTO, mission_id: string, transactionManager?: EntityManager) {
killedBy: PersonMissionService getPersonMissionByMissionId should throw an error if person mission is not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/domain/person-mission/person-mission.service.ts:16:30
     async getPersonMissionByMissionId(mission_id: string) {
         const person_mission = await this.personMissionRepository.getPersonMissionByMissionId(mission_id);
 
-        if (!person_mission) {
-            throw new BadRequestException(`Missão com id ${mission_id} não encontrada.`);
-        };
+        if (!person_mission) {};
 
         return person_mission;
killedBy: PersonMissionService getPersonMissionByMissionId should throw an error if person mission is not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] ConditionalExpression
src/domain/person-mission/person-mission.service.ts:16:13
     async getPersonMissionByMissionId(mission_id: string) {
         const person_mission = await this.personMissionRepository.getPersonMissionByMissionId(mission_id);
 
-        if (!person_mission) {
+        if (true) {
             throw new BadRequestException(`Missão com id ${mission_id} não encontrada.`);
         };
killedBy: PersonMissionService getPersonMissionByMissionId should return a person mission
statusReason: BadRequestException: Missão com id e171bb26-444a-4ffb-b802-595941433460 não encontrada.

[Killed] StringLiteral
src/domain/person-mission/person-mission.service.ts:17:43
         const person_mission = await this.personMissionRepository.getPersonMissionByMissionId(mission_id);
 
         if (!person_mission) {
-            throw new BadRequestException(`Missão com id ${mission_id} não encontrada.`);
+            throw new BadRequestException(``);
         };
 
killedBy: PersonMissionService getPersonMissionByMissionId should throw an error if person mission is not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Missão com id e171bb26-444a-4ffb-b802-595941433460 não encontrada."
Received message:   "Bad Request"

      67 |         } else {
      68 |           stryCov_9fa48("352");
    > 69 |           throw new BadRequestException(stryMutAct_9fa48("353") ? `` : (stryCov_9fa48("353"), `Missão com id ${mission_id} não encontrada.`));

[Killed] BlockStatement
src/domain/person-mission/person-mission.service.ts:23:135
         return person_mission;
     }
 
-    async createPersonMission(createPersonMissionDTO: CreatePersonMissionDTO, mission_id: string, transactionManager?: EntityManager) {
-        if (createPersonMissionDTO.name.length < this.MIN_NAME_PERSON_LENGTH) {
-            throw new BadRequestException(`Nome deve ter no mínimo ${this.MIN_NAME_PERSON_LENGTH} caracteres.`);
-        };
-
-        createPersonMissionDTO.color = createPersonMissionDTO.color.toUpperCase();
-        createPersonMissionDTO.gender = createPersonMissionDTO.gender.toUpperCase();
-
-        if (!Object.values(PersonColor).includes(createPersonMissionDTO.color as PersonColor)) {
-            throw new BadRequestException(`Cor inválida: ${createPersonMissionDTO.color}.`);
-        };
-
-        if (!Object.values(PersonGender).includes(createPersonMissionDTO.gender as PersonGender)) {
-            throw new BadRequestException(`Gênero inválido: ${createPersonMissionDTO.gender}.`);
-        };
-
-        const created_person_mission = this.personMissionRepository.createPersonMission(createPersonMissionDTO);
-        const saved_person_mission = await this.personMissionRepository.savePersonMission({
-            ...created_person_mission,
-            mission_id
-        }, transactionManager);
-
-        return saved_person_mission;
-    };
+    async createPersonMission(createPersonMissionDTO: CreatePersonMissionDTO, mission_id: string, transactionManager?: EntityManager) {};
 }
killedBy: PersonMissionService createPersonMission should throw an error if name is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/person-mission/person-mission.service.ts:24:13
     }
 
     async createPersonMission(createPersonMissionDTO: CreatePersonMissionDTO, mission_id: string, transactionManager?: EntityManager) {
-        if (createPersonMissionDTO.name.length < this.MIN_NAME_PERSON_LENGTH) {
+        if (false) {
             throw new BadRequestException(`Nome deve ter no mínimo ${this.MIN_NAME_PERSON_LENGTH} caracteres.`);
         };
killedBy: PersonMissionService createPersonMission should throw an error if name is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
src/domain/person-mission/person-mission.service.ts:24:13
     }
 
     async createPersonMission(createPersonMissionDTO: CreatePersonMissionDTO, mission_id: string, transactionManager?: EntityManager) {
-        if (createPersonMissionDTO.name.length < this.MIN_NAME_PERSON_LENGTH) {
+        if (createPersonMissionDTO.name.length >= this.MIN_NAME_PERSON_LENGTH) {
             throw new BadRequestException(`Nome deve ter no mínimo ${this.MIN_NAME_PERSON_LENGTH} caracteres.`);
         };
killedBy: PersonMissionService createPersonMission should throw an error if name is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] MethodExpression
src/domain/person-mission/person-mission.service.ts:28:40
             throw new BadRequestException(`Nome deve ter no mínimo ${this.MIN_NAME_PERSON_LENGTH} caracteres.`);
         };
 
-        createPersonMissionDTO.color = createPersonMissionDTO.color.toUpperCase();
+        createPersonMissionDTO.color = createPersonMissionDTO.color.toLowerCase();
         createPersonMissionDTO.gender = createPersonMissionDTO.gender.toUpperCase();
 
killedBy: PersonMissionService createPersonMission should throw BadRequestException if gender is invalid
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Gênero inválido: INVALID_GENDER."
Received message:   "Cor inválida: branca."

       95 |         } else {
       96 |           stryCov_9fa48("366");
    >  97 |           throw new BadRequestException(stryMutAct_9fa48("367") ? `` : (stryCov_9fa48("367"), `Cor inválida: ${createPersonMissionDTO.color}.`));

[Killed] MethodExpression
src/domain/person-mission/person-mission.service.ts:29:41
         };
 
         createPersonMissionDTO.color = createPersonMissionDTO.color.toUpperCase();
-        createPersonMissionDTO.gender = createPersonMissionDTO.gender.toUpperCase();
+        createPersonMissionDTO.gender = createPersonMissionDTO.gender.toLowerCase();
 
         if (!Object.values(PersonColor).includes(createPersonMissionDTO.color as PersonColor)) {
killedBy: PersonMissionService createPersonMission should successfully create a person mission
statusReason: BadRequestException: Gênero inválido: feminino.

[Killed] ConditionalExpression
src/domain/person-mission/person-mission.service.ts:31:13
         createPersonMissionDTO.color = createPersonMissionDTO.color.toUpperCase();
         createPersonMissionDTO.gender = createPersonMissionDTO.gender.toUpperCase();
 
-        if (!Object.values(PersonColor).includes(createPersonMissionDTO.color as PersonColor)) {
+        if (false) {
             throw new BadRequestException(`Cor inválida: ${createPersonMissionDTO.color}.`);
         };
killedBy: PersonMissionService createPersonMission should throw BadRequestException if color is invalid
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/person-mission/person-mission.service.ts:31:13
         createPersonMissionDTO.color = createPersonMissionDTO.color.toUpperCase();
         createPersonMissionDTO.gender = createPersonMissionDTO.gender.toUpperCase();
 
-        if (!Object.values(PersonColor).includes(createPersonMissionDTO.color as PersonColor)) {
+        if (true) {
             throw new BadRequestException(`Cor inválida: ${createPersonMissionDTO.color}.`);
         };
killedBy: PersonMissionService createPersonMission should throw BadRequestException if gender is invalid
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Gênero inválido: INVALID_GENDER."
Received message:   "Cor inválida: BRANCA."

       95 |         } else {
       96 |           stryCov_9fa48("366");
    >  97 |           throw new BadRequestException(stryMutAct_9fa48("367") ? `` : (stryCov_9fa48("367"), `Cor inválida: ${createPersonMissionDTO.color}.`));

[Killed] ConditionalExpression
src/domain/person-mission/person-mission.service.ts:35:13
             throw new BadRequestException(`Cor inválida: ${createPersonMissionDTO.color}.`);
         };
 
-        if (!Object.values(PersonGender).includes(createPersonMissionDTO.gender as PersonGender)) {
+        if (false) {
             throw new BadRequestException(`Gênero inválido: ${createPersonMissionDTO.gender}.`);
         };
killedBy: PersonMissionService createPersonMission should throw BadRequestException if gender is invalid
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/domain/person-mission/person-mission.service.ts:35:99
             throw new BadRequestException(`Cor inválida: ${createPersonMissionDTO.color}.`);
         };
 
-        if (!Object.values(PersonGender).includes(createPersonMissionDTO.gender as PersonGender)) {
-            throw new BadRequestException(`Gênero inválido: ${createPersonMissionDTO.gender}.`);
-        };
+        if (!Object.values(PersonGender).includes(createPersonMissionDTO.gender as PersonGender)) {};
 
         const created_person_mission = this.personMissionRepository.createPersonMission(createPersonMissionDTO);
killedBy: PersonMissionService createPersonMission should throw BadRequestException if gender is invalid
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
src/domain/person-mission/person-mission.service.ts:36:43
         };
 
         if (!Object.values(PersonGender).includes(createPersonMissionDTO.gender as PersonGender)) {
-            throw new BadRequestException(`Gênero inválido: ${createPersonMissionDTO.gender}.`);
+            throw new BadRequestException(``);
         };
 
killedBy: PersonMissionService createPersonMission should throw BadRequestException if gender is invalid
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Gênero inválido: INVALID_GENDER."
Received message:   "Bad Request"

      104 |         } else {
      105 |           stryCov_9fa48("371");
    > 106 |           throw new BadRequestException(stryMutAct_9fa48("372") ? `` : (stryCov_9fa48("372"), `Gênero inválido: ${createPersonMissionDTO.gender}.`));

[Survived] ObjectLiteral
src/domain/person-mission/person-mission.service.ts:40:91
         };
 
         const created_person_mission = this.personMissionRepository.createPersonMission(createPersonMissionDTO);
-        const saved_person_mission = await this.personMissionRepository.savePersonMission({
-            ...created_person_mission,
-            mission_id
-        }, transactionManager);
+        const saved_person_mission = await this.personMissionRepository.savePersonMission({}, transactionManager);
 
         return saved_person_mission;
