[Killed] BlockStatement
src/domain/pet-mission/pet-mission.service.ts:13:56
     private readonly MIN_PREDOMINANT_COLOR_LENGTH = 3;
     constructor(private readonly petMissionRepositoryImpl: PetMissionRepositoryImpl) { }
 
-    async getPetMissionByMissionId(mission_id: string) {
-        const pet_mission = await this.petMissionRepositoryImpl.getPetMissionByMissionId(mission_id);
-
-        if (!pet_mission) {
-            throw new BadRequestException(`Missão com id ${mission_id} não encontrada.`);
-        };
-
-        return pet_mission;
-    }
+    async getPetMissionByMissionId(mission_id: string) {}
 
     async createPetMission(createPetMissionDTO: CreatePetMissionDTO, mission_id: string, transactionManager?: EntityManager) {
killedBy: PetMissionService getPetMissionByMissionId should return a pet mission
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"age": 5, "name": "Bob", "pet_species": "poodle", "predominant_color": "branco", "sex": "macho"}
Received: undefined

[Killed] ConditionalExpression
src/domain/pet-mission/pet-mission.service.ts:16:13
     async getPetMissionByMissionId(mission_id: string) {
         const pet_mission = await this.petMissionRepositoryImpl.getPetMissionByMissionId(mission_id);
 
-        if (!pet_mission) {
+        if (true) {
             throw new BadRequestException(`Missão com id ${mission_id} não encontrada.`);
         };
killedBy: PetMissionService getPetMissionByMissionId should return a pet mission
statusReason: BadRequestException: Missão com id e171bb26-444a-4ffb-b802-595941433460 não encontrada.

[Killed] BooleanLiteral
src/domain/pet-mission/pet-mission.service.ts:16:13
     async getPetMissionByMissionId(mission_id: string) {
         const pet_mission = await this.petMissionRepositoryImpl.getPetMissionByMissionId(mission_id);
 
-        if (!pet_mission) {
+        if (pet_mission) {
             throw new BadRequestException(`Missão com id ${mission_id} não encontrada.`);
         };
killedBy: PetMissionService getPetMissionByMissionId should return a pet mission
statusReason: BadRequestException: Missão com id e171bb26-444a-4ffb-b802-595941433460 não encontrada.

[Killed] StringLiteral
src/domain/pet-mission/pet-mission.service.ts:17:43
         const pet_mission = await this.petMissionRepositoryImpl.getPetMissionByMissionId(mission_id);
 
         if (!pet_mission) {
-            throw new BadRequestException(`Missão com id ${mission_id} não encontrada.`);
+            throw new BadRequestException(``);
         };
 
killedBy: PetMissionService getPetMissionByMissionId should throw an error if pet mission is not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Missão com id e171bb26-444a-4ffb-b802-595941433460 não encontrada."
Received: "Bad Request"

[Killed] BlockStatement
src/domain/pet-mission/pet-mission.service.ts:23:126
         return pet_mission;
     }
 
-    async createPetMission(createPetMissionDTO: CreatePetMissionDTO, mission_id: string, transactionManager?: EntityManager) {
-        if (createPetMissionDTO.name.length < this.MIN_NAME_PET_LENGTH) {
-            throw new BadRequestException(`Nome deve ter no mínimo ${this.MIN_NAME_PET_LENGTH} caracteres.`);
-        };
-
-        if (createPetMissionDTO.predominant_color.length < this.MIN_PREDOMINANT_COLOR_LENGTH) {
-            throw new BadRequestException(`Cor deve ter no mínimo ${this.MIN_PREDOMINANT_COLOR_LENGTH} caracteres.`);
-        };
-
-        createPetMissionDTO.sex = createPetMissionDTO.sex.toUpperCase();
-
-        if (!Object.values(PetSex).includes(createPetMissionDTO.sex as PetSex)) {
-            throw new BadRequestException(`Sexo inválido: ${createPetMissionDTO.sex}.`);
-        };
-
-        const created_person_mission = this.petMissionRepositoryImpl.createPetMission(createPetMissionDTO);
-        const saved_person_mission = await this.petMissionRepositoryImpl.savePetMission({
-            ...created_person_mission,
-            mission_id
-        }, transactionManager);
-
-        return saved_person_mission;
-    };
+    async createPetMission(createPetMissionDTO: CreatePetMissionDTO, mission_id: string, transactionManager?: EntityManager) {};
 }
killedBy: PetMissionService createPetMission should throw BadRequestException if sex is invalid
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
src/domain/pet-mission/pet-mission.service.ts:24:13
     }
 
     async createPetMission(createPetMissionDTO: CreatePetMissionDTO, mission_id: string, transactionManager?: EntityManager) {
-        if (createPetMissionDTO.name.length < this.MIN_NAME_PET_LENGTH) {
+        if (createPetMissionDTO.name.length >= this.MIN_NAME_PET_LENGTH) {
             throw new BadRequestException(`Nome deve ter no mínimo ${this.MIN_NAME_PET_LENGTH} caracteres.`);
         };
killedBy: PetMissionService createPetMission should throw an error if predominant_color is less than 3 characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Cor deve ter no mínimo 3 caracteres."
Received: "Nome deve ter no mínimo 3 caracteres."

[Killed] EqualityOperator
src/domain/pet-mission/pet-mission.service.ts:24:13
     }
 
     async createPetMission(createPetMissionDTO: CreatePetMissionDTO, mission_id: string, transactionManager?: EntityManager) {
-        if (createPetMissionDTO.name.length < this.MIN_NAME_PET_LENGTH) {
+        if (createPetMissionDTO.name.length <= this.MIN_NAME_PET_LENGTH) {
             throw new BadRequestException(`Nome deve ter no mínimo ${this.MIN_NAME_PET_LENGTH} caracteres.`);
         };
killedBy: PetMissionService createPetMission should throw an error if predominant_color is less than 3 characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Cor deve ter no mínimo 3 caracteres."
Received: "Nome deve ter no mínimo 3 caracteres."

[Killed] EqualityOperator
src/domain/pet-mission/pet-mission.service.ts:28:13
             throw new BadRequestException(`Nome deve ter no mínimo ${this.MIN_NAME_PET_LENGTH} caracteres.`);
         };
 
-        if (createPetMissionDTO.predominant_color.length < this.MIN_PREDOMINANT_COLOR_LENGTH) {
+        if (createPetMissionDTO.predominant_color.length >= this.MIN_PREDOMINANT_COLOR_LENGTH) {
             throw new BadRequestException(`Cor deve ter no mínimo ${this.MIN_PREDOMINANT_COLOR_LENGTH} caracteres.`);
         };
killedBy: PetMissionService createPetMission should throw BadRequestException if sex is invalid
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Sexo inválido: INVALID_SEX."
Received message:   "Cor deve ter no mínimo 3 caracteres."

      93 |         } else {
      94 |           stryCov_9fa48("391");
    > 95 |           throw new BadRequestException(stryMutAct_9fa48("392") ? `` : (stryCov_9fa48("392"), `Cor deve ter no mínimo ${this.MIN_PREDOMINANT_COLOR_LENGTH} ca

[Killed] ConditionalExpression
src/domain/pet-mission/pet-mission.service.ts:28:13
             throw new BadRequestException(`Nome deve ter no mínimo ${this.MIN_NAME_PET_LENGTH} caracteres.`);
         };
 
-        if (createPetMissionDTO.predominant_color.length < this.MIN_PREDOMINANT_COLOR_LENGTH) {
+        if (true) {
             throw new BadRequestException(`Cor deve ter no mínimo ${this.MIN_PREDOMINANT_COLOR_LENGTH} caracteres.`);
         };
killedBy: PetMissionService createPetMission should throw BadRequestException if sex is invalid
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Sexo inválido: INVALID_SEX."
Received message:   "Cor deve ter no mínimo 3 caracteres."

      93 |         } else {
      94 |           stryCov_9fa48("391");
    > 95 |           throw new BadRequestException(stryMutAct_9fa48("392") ? `` : (stryCov_9fa48("392"), `Cor deve ter no mínimo ${this.MIN_PREDOMINANT_COLOR_LENGTH} ca

[Killed] MethodExpression
src/domain/pet-mission/pet-mission.service.ts:32:35
             throw new BadRequestException(`Cor deve ter no mínimo ${this.MIN_PREDOMINANT_COLOR_LENGTH} caracteres.`);
         };
 
-        createPetMissionDTO.sex = createPetMissionDTO.sex.toUpperCase();
+        createPetMissionDTO.sex = createPetMissionDTO.sex.toLowerCase();
 
         if (!Object.values(PetSex).includes(createPetMissionDTO.sex as PetSex)) {
killedBy: PetMissionService createPetMission should create a person mission successfully
statusReason: BadRequestException: Sexo inválido: macho.

[Killed] BooleanLiteral
src/domain/pet-mission/pet-mission.service.ts:34:13
 
         createPetMissionDTO.sex = createPetMissionDTO.sex.toUpperCase();
 
-        if (!Object.values(PetSex).includes(createPetMissionDTO.sex as PetSex)) {
+        if (Object.values(PetSex).includes(createPetMissionDTO.sex as PetSex)) {
             throw new BadRequestException(`Sexo inválido: ${createPetMissionDTO.sex}.`);
         };
killedBy: PetMissionService createPetMission should throw BadRequestException if sex is invalid
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/pet-mission/pet-mission.service.ts:34:13
 
         createPetMissionDTO.sex = createPetMissionDTO.sex.toUpperCase();
 
-        if (!Object.values(PetSex).includes(createPetMissionDTO.sex as PetSex)) {
+        if (false) {
             throw new BadRequestException(`Sexo inválido: ${createPetMissionDTO.sex}.`);
         };
killedBy: PetMissionService createPetMission should throw BadRequestException if sex is invalid
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined
