[Killed] BlockStatement
src/domain/rewards-editions/rewards-editions.service.ts:14:96
         return Math.round(current_reward * 100);
     };
 
-    async getRewardsEditionByMissionId(mission_id: string, transactionManager?: EntityManager) {
-        const rewards_edition = await this.rewardsEditionsRepositoryImpl.getRewardsEditionByMissionId(mission_id, transactionManager);
-
-        return rewards_edition;
-    }
+    async getRewardsEditionByMissionId(mission_id: string, transactionManager?: EntityManager) {}
 
     async createRewardsEdition(createRewarsEditionsDTO: CreateRewarsEditionsDTO, transactionManager?: EntityManager) {
killedBy: RewardsEditionsService getRewardsEditionByMissionId should return an array of rewards editions by mission id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "3e984c39-421e-4550-bc14-52ea36de9ad8", undefined

Number of calls: 0

[Killed] BlockStatement
src/domain/rewards-editions/rewards-editions.service.ts:20:118
         return rewards_edition;
     }
 
-    async createRewardsEdition(createRewarsEditionsDTO: CreateRewarsEditionsDTO, transactionManager?: EntityManager) {
-        const created_rewards_edition = this.rewardsEditionsRepositoryImpl.createRewardsEdition({
-            ...createRewarsEditionsDTO,
-            value: this.convertToCents(createRewarsEditionsDTO.value)
-        },);
-
-        const saved_rewards_edition = await this.rewardsEditionsRepositoryImpl.saveRewardsEdition({
-            ...created_rewards_edition,
-            value: this.convertToCents(createRewarsEditionsDTO.value)
-        }, transactionManager);
-
-        return saved_rewards_edition;
-    };
+    async createRewardsEdition(createRewarsEditionsDTO: CreateRewarsEditionsDTO, transactionManager?: EntityManager) {};
 }
killedBy: RewardsEditionsService createRewardsEdition should call createRewardsEdition and saveRewardsEdition
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"mission_id": "3e984c39-421e-4550-bc14-52ea36de9ad8", "value": 100000}

Number of calls: 0
