[Killed] ConditionalExpression
src/domain/user/user.service.ts:15:13
 
     async createUser(createUserDTO: CreateUserDTO) {
         //TODO: ver como deve ser comportar o campo "status"
-        if (createUserDTO.first_name.length < this.MIN_FIRST_NAME_LENGTH) {
+        if (false) {
             throw new BadRequestException(`Primeiro nome deve ter no mínimo ${this.MIN_FIRST_NAME_LENGTH} caracteres.`);
         };
killedBy: UserService createUser should throw BadRequestException if first_name is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/user/user.service.ts:15:13
 
     async createUser(createUserDTO: CreateUserDTO) {
         //TODO: ver como deve ser comportar o campo "status"
-        if (createUserDTO.first_name.length < this.MIN_FIRST_NAME_LENGTH) {
+        if (true) {
             throw new BadRequestException(`Primeiro nome deve ter no mínimo ${this.MIN_FIRST_NAME_LENGTH} caracteres.`);
         };
killedBy: UserService createUser should throw BadRequestException if last_name is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Sobrenome deve ter no mínimo 3 caracteres."
Received message:   "Primeiro nome deve ter no mínimo 3 caracteres."

      67 |         } else {
      68 |           stryCov_9fa48("411");
    > 69 |           throw new BadRequestException(stryMutAct_9fa48("412") ? `` : (stryCov_9fa48("412"), `Primeiro nome deve ter no mínimo ${th

[Killed] StringLiteral
src/domain/user/user.service.ts:16:43
     async createUser(createUserDTO: CreateUserDTO) {
         //TODO: ver como deve ser comportar o campo "status"
         if (createUserDTO.first_name.length < this.MIN_FIRST_NAME_LENGTH) {
-            throw new BadRequestException(`Primeiro nome deve ter no mínimo ${this.MIN_FIRST_NAME_LENGTH} caracteres.`);
+            throw new BadRequestException(``);
         };
 
killedBy: UserService createUser should throw BadRequestException if first_name is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Primeiro nome deve ter no mínimo 3 caracteres."
Received message:   "Bad Request"

      67 |         } else {
      68 |           stryCov_9fa48("411");
    > 69 |           throw new BadRequestException(stryMutAct_9fa48("412") ? `` : (stryCov_9fa48("412"), `Primeiro nome deve ter no mínimo ${this.MIN_FIRST_NAME_LENGTH} carac

[Killed] ConditionalExpression
src/domain/user/user.service.ts:19:13
             throw new BadRequestException(`Primeiro nome deve ter no mínimo ${this.MIN_FIRST_NAME_LENGTH} caracteres.`);
         };
 
-        if (createUserDTO.last_name.length < this.MIN_LAST_NAME_LENGTH) {
+        if (true) {
             throw new BadRequestException(`Sobrenome deve ter no mínimo ${this.MIN_LAST_NAME_LENGTH} caracteres.`);
         };
killedBy: UserService createUser should throw BadRequestException if email is invalid
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Email inválido."
Received message:   "Sobrenome deve ter no mínimo 3 caracteres."

      76 |         } else {
      77 |           stryCov_9fa48("417");
    > 78 |           throw new BadRequestException(stryMutAct_9fa48("418") ? `` : (stryCov_9fa48("418"), `Sobrenome deve ter no mínimo ${this.MIN_LAST_NAME_LENGTH} caracteres

[Killed] EqualityOperator
src/domain/user/user.service.ts:19:13
             throw new BadRequestException(`Primeiro nome deve ter no mínimo ${this.MIN_FIRST_NAME_LENGTH} caracteres.`);
         };
 
-        if (createUserDTO.last_name.length < this.MIN_LAST_NAME_LENGTH) {
+        if (createUserDTO.last_name.length >= this.MIN_LAST_NAME_LENGTH) {
             throw new BadRequestException(`Sobrenome deve ter no mínimo ${this.MIN_LAST_NAME_LENGTH} caracteres.`);
         };
killedBy: UserService createUser should throw BadRequestException if last_name is less than 3 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/user/user.service.ts:23:13
             throw new BadRequestException(`Sobrenome deve ter no mínimo ${this.MIN_LAST_NAME_LENGTH} caracteres.`);
         };
 
-        if (!createUserDTO.email.includes('@')) {
+        if (true) {
             throw new BadRequestException('Email inválido.');
         };
killedBy: UserService createUser should throw BadRequestException if user is under 18 years old
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "O usuário deve ter pelo menos 18 anos."
Received message:   "Email inválido."

      85 |         } else {
      86 |           stryCov_9fa48("423");
    > 87 |           throw new BadRequestException(stryMutAct_9fa48("424") ? "" : (stryCov_9fa48("424"), 'Email inválido.'));

[Killed] BlockStatement
src/domain/user/user.service.ts:23:49
             throw new BadRequestException(`Sobrenome deve ter no mínimo ${this.MIN_LAST_NAME_LENGTH} caracteres.`);
         };
 
-        if (!createUserDTO.email.includes('@')) {
-            throw new BadRequestException('Email inválido.');
-        };
+        if (!createUserDTO.email.includes('@')) {};
 
         const today = new Date();
killedBy: UserService createUser should throw BadRequestException if email is invalid
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ArithmeticOperator
src/domain/user/user.service.ts:29:19
 
         const today = new Date();
         const birthDate = new Date(createUserDTO.birth_date);
-        let age = today.getFullYear() - birthDate.getFullYear();
+        let age = today.getFullYear() + birthDate.getFullYear();
         const monthDifference = today.getMonth() - birthDate.getMonth();
 
killedBy: UserService createUser should throw BadRequestException if user is under 18 years old
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] ArithmeticOperator
src/domain/user/user.service.ts:30:33
         const today = new Date();
         const birthDate = new Date(createUserDTO.birth_date);
         let age = today.getFullYear() - birthDate.getFullYear();
-        const monthDifference = today.getMonth() - birthDate.getMonth();
+        const monthDifference = today.getMonth() + birthDate.getMonth();
 
         if (

[Survived] ConditionalExpression
src/domain/user/user.service.ts:33:13
         const monthDifference = today.getMonth() - birthDate.getMonth();
 
         if (
-            monthDifference < 0 ||
-            (monthDifference === 0 && today.getDate() < birthDate.getDate())
+            true
         ) {
             age--;

[Survived] EqualityOperator
src/domain/user/user.service.ts:33:13
         const monthDifference = today.getMonth() - birthDate.getMonth();
 
         if (
-            monthDifference < 0 ||
+            monthDifference <= 0 ||
             (monthDifference === 0 && today.getDate() < birthDate.getDate())
         ) {

[Survived] EqualityOperator
src/domain/user/user.service.ts:34:14
 
         if (
             monthDifference < 0 ||
-            (monthDifference === 0 && today.getDate() < birthDate.getDate())
+            (monthDifference !== 0 && today.getDate() < birthDate.getDate())
         ) {
             age--;

[Survived] ConditionalExpression
src/domain/user/user.service.ts:34:14
 
         if (
             monthDifference < 0 ||
-            (monthDifference === 0 && today.getDate() < birthDate.getDate())
+            (false)
         ) {
             age--;

[Survived] BlockStatement
src/domain/user/user.service.ts:35:11
         if (
             monthDifference < 0 ||
             (monthDifference === 0 && today.getDate() < birthDate.getDate())
-        ) {
-            age--;
-        }
+        ) {}
 
         if (age < this.MIN_USER_AGE) {

[Survived] UpdateOperator
src/domain/user/user.service.ts:36:13
             monthDifference < 0 ||
             (monthDifference === 0 && today.getDate() < birthDate.getDate())
         ) {
-            age--;
+            age++;
         }
 

[Killed] ConditionalExpression
src/domain/user/user.service.ts:39:13
             age--;
         }
 
-        if (age < this.MIN_USER_AGE) {
+        if (true) {
             throw new BadRequestException(`O usuário deve ter pelo menos ${this.MIN_USER_AGE} anos.`);
         }
killedBy: UserService createUser should throw BadRequestException if email already exists
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Email já existe. Por favor, insira outro email."
Received message:   "O usuário deve ter pelo menos 18 anos."

      106 |         } else {
      107 |           stryCov_9fa48("446");
    > 108 |           throw new BadRequestException(stryMutAct_9fa48("447") ? `` : (stryCov_9fa48("447"), `O usuário deve ter pelo menos ${this.

[Killed] BlockStatement
src/domain/user/user.service.ts:39:38
             age--;
         }
 
-        if (age < this.MIN_USER_AGE) {
-            throw new BadRequestException(`O usuário deve ter pelo menos ${this.MIN_USER_AGE} anos.`);
-        }
+        if (age < this.MIN_USER_AGE) {}
 
         const existing_email = await this.userRepository.getUserByEmail(createUserDTO.email);
killedBy: UserService createUser should throw BadRequestException if user is under 18 years old
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/user/user.service.ts:45:13
 
         const existing_email = await this.userRepository.getUserByEmail(createUserDTO.email);
 
-        if (existing_email) {
+        if (true) {
             throw new BadRequestException('Email já existe. Por favor, insira outro email.');
         };
killedBy: UserService createUser should throw BadRequestException if phone already exists
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Número de celular já existe. Por favor, insira outro número."
Received message:   "Email já existe. Por favor, insira outro email."

      115 |         } else {
      116 |           stryCov_9fa48("450");
    > 117 |           throw new BadRequestException(stryMutAct_9fa48("451") ? "" : (stryCov_9fa48("451"), 'Email já existe

[Killed] BlockStatement
src/domain/user/user.service.ts:45:29
 
         const existing_email = await this.userRepository.getUserByEmail(createUserDTO.email);
 
-        if (existing_email) {
-            throw new BadRequestException('Email já existe. Por favor, insira outro email.');
-        };
+        if (existing_email) {};
 
         const existing_phone = await this.userRepository.getUserByPhone(createUserDTO.phone);
killedBy: UserService createUser should throw BadRequestException if email already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/user/user.service.ts:51:13
 
         const existing_phone = await this.userRepository.getUserByPhone(createUserDTO.phone);
 
-        if (existing_phone) {
+        if (false) {
             throw new BadRequestException('Número de celular já existe. Por favor, insira outro número.');
         };
killedBy: UserService createUser should throw BadRequestException if phone already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/user/user.service.ts:51:13
 
         const existing_phone = await this.userRepository.getUserByPhone(createUserDTO.phone);
 
-        if (existing_phone) {
+        if (true) {
             throw new BadRequestException('Número de celular já existe. Por favor, insira outro número.');
         };
killedBy: UserService createUser should throw BadRequestException if password does not meet criteria
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "A senha deve conter no mínimo 6 caracteres, uma letra maiúscula, uma letra minúscula e um caractere especial."
Received message:   "Número de celular já existe. Por favor, insira outro número."

      125 |         } else {
      126 |           stryCov_9fa48("454");
    > 127 |           throw new BadRequestException(stryMutA

[Killed] BlockStatement
src/domain/user/user.service.ts:55:84
             throw new BadRequestException('Número de celular já existe. Por favor, insira outro número.');
         };
 
-        if (!/^(?=.*[a-z])(?=.*[A-Z])(?=.*\W).{6,}$/.test(createUserDTO.password)) {
-            throw new BadRequestException('A senha deve conter no mínimo 6 caracteres, uma letra maiúscula, uma letra minúscula e um caractere especial.');
-        };
+        if (!/^(?=.*[a-z])(?=.*[A-Z])(?=.*\W).{6,}$/.test(createUserDTO.password)) {};
 
         const created_user = await this.userRepository.createUser(createUserDTO);
killedBy: UserService createUser should throw BadRequestException if password does not meet criteria
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/user/user.service.ts:55:13
             throw new BadRequestException('Número de celular já existe. Por favor, insira outro número.');
         };
 
-        if (!/^(?=.*[a-z])(?=.*[A-Z])(?=.*\W).{6,}$/.test(createUserDTO.password)) {
+        if (true) {
             throw new BadRequestException('A senha deve conter no mínimo 6 caracteres, uma letra maiúscula, uma letra minúscula e um caractere especial.');
         };
killedBy: UserService createUser should create and save user successfully
statusReason: BadRequestException: A senha deve conter no mínimo 6 caracteres, uma letra maiúscula, uma letra minúscula e um caractere especial.

[Killed] StringLiteral
src/domain/user/user.service.ts:56:43
         };
 
         if (!/^(?=.*[a-z])(?=.*[A-Z])(?=.*\W).{6,}$/.test(createUserDTO.password)) {
-            throw new BadRequestException('A senha deve conter no mínimo 6 caracteres, uma letra maiúscula, uma letra minúscula e um caractere especial.');
+            throw new BadRequestException("");
         };
 
killedBy: UserService createUser should throw BadRequestException if password does not meet criteria
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "A senha deve conter no mínimo 6 caracteres, uma letra maiúscula, uma letra minúscula e um caractere especial."
Received message:   "Bad Request"

      134 |         } else {
      135 |           stryCov_9fa48("471");
    > 136 |           throw new BadRequestException(stryMutAct_9fa48("472") ? "" : (stryCov_9fa48("472"), 'A

[Killed] BlockStatement
src/domain/user/user.service.ts:66:71
         return saved_user;
     };
 
-    async getUserById(user_id: string, entityManager?: EntityManager) {
-        const user = await this.userRepository.getUserById(user_id, entityManager);
-
-        if (!user) {
-            throw new NotFoundException('Usuário não encontrado.');
-        };
-
-        return user;
-    };
+    async getUserById(user_id: string, entityManager?: EntityManager) {};
 };
killedBy: UserService getUserById repository should be defined
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/domain/user/user.service.ts:69:20
     async getUserById(user_id: string, entityManager?: EntityManager) {
         const user = await this.userRepository.getUserById(user_id, entityManager);
 
-        if (!user) {
-            throw new NotFoundException('Usuário não encontrado.');
-        };
+        if (!user) {};
 
         return user;
killedBy: UserService getUserById repository should be defined
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] StringLiteral
src/domain/user/user.service.ts:70:41
         const user = await this.userRepository.getUserById(user_id, entityManager);
 
         if (!user) {
-            throw new NotFoundException('Usuário não encontrado.');
+            throw new NotFoundException("");
         };
 
killedBy: UserService getUserById repository should be defined
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Usuário não encontrado."
Received message:   "Not Found"

      154 |         } else {
      155 |           stryCov_9fa48("477");
    > 156 |           throw new NotFoundException(stryMutAct_9fa48("478") ? "" : (stryCov_9fa48("478"), 'Usuário não encontrado.'));
